(ǝʃpuɐɥ˙uʍopʇnɥs 'uʍopʇnɥs˙sʞɔɐqʃʃɐɔ‾ǝ)ppɐ˙sʞɔɐqʃʃɐɔ
("ɥʇɐǝp‾ɹǝʎɐʃd" 'ǝʃpuɐɥ˙ʎɐs‾ʃʃıʞ 'ʇuǝʌǝ˙sʞɔɐqʃʃɐɔ‾ǝ)ppɐ˙sʞɔɐqʃʃɐɔ
(ǝʇɐpdn˙ƃɐʃǝʞɐɟ 'ɯıɐıʇuɐ˙sʞɔɐqʃʃɐɔ‾ǝ)ppɐ˙sʞɔɐqʃʃɐɔ
(ǝʃpuɐɥ˙sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ 'ɯıɐıʇuɐ˙sʞɔɐqʃʃɐɔ‾ǝ)ppɐ˙sʞɔɐqʃʃɐɔ
(ǝʃpuɐɥ˙sɯıɐıʇuɐ‾ʇʃnɐɟǝp 'ɯıɐıʇuɐ˙sʞɔɐqʃʃɐɔ‾ǝ)ppɐ˙sʞɔɐqʃʃɐɔ
(ǝʃpuɐɥ˙ɯıɐıʇuɐ‾ʃʃoɹ 'ɯıɐıʇuɐ˙sʞɔɐqʃʃɐɔ‾ǝ)ppɐ˙sʞɔɐqʃʃɐɔ
(ǝʃpuɐɥ˙ɹǝʞɐǝɹq‾uoıʇɐɯıuɐ 'ɯıɐıʇuɐ˙sʞɔɐqʃʃɐɔ‾ǝ)ppɐ˙sʞɔɐqʃʃɐɔ
(ɹıɐ˙ǝɔuɐɥɔʇıɥ‾ʃɐuoıʇıpuoɔ 'uɐɔsʇıɥ˙sʞɔɐqʃʃɐɔ‾ǝ)ppɐ˙sʞɔɐqʃʃɐɔ
("ǝɹıɟ‾uodɐǝʍ" 'ǝɟıuʞʇp˙sɹǝʃpuɐɥ 'ʇuǝʌǝ˙sʞɔɐqʃʃɐɔ‾ǝ)ppɐ˙sʞɔɐqʃʃɐɔ
(ʇɹɐʇs‾ǝʇɐpdnǝɹıɟuo˙sǝuıɟǝp 'ʇooɥs‾ʇoqɯıɐ˙sʞɔɐqʃʃɐɔ‾ǝ)ppɐ˙sʞɔɐqʃʃɐɔ
(ǝƃɹɐɥɔ˙ɹǝʃʃoɹʇuoɔ‾dɐʇǝʃqnop 'puɐɯɯoɔ‾dnʇǝs˙sʞɔɐqʃʃɐɔ‾ǝ)ppɐ˙sʞɔɐqʃʃɐɔ
(ǝʃpuɐɥ˙ɹǝʃʃoɹʇuoɔ‾dɐʇǝʃqnop 'puɐɯɯoɔ‾dnʇǝs˙sʞɔɐqʃʃɐɔ‾ǝ)ppɐ˙sʞɔɐqʃʃɐɔ
(ǝɟıuʞ˙sɹǝʃpuɐɥ 'puɐɯɯoɔ‾dnʇǝs˙sʞɔɐqʃʃɐɔ‾ǝ)ppɐ˙sʞɔɐqʃʃɐɔ
(ʍɐɹp˙ɹoʇɐɔıpuı‾ɹıɐɥssoɹɔ 'ʇuıɐd˙sʞɔɐqʃʃɐɔ‾ǝ)ppɐ˙sʞɔɐqʃʃɐɔ
(ʍɐɹp˙ɹoʇɐɔıpuı‾ƃɐʃǝʞɐɟ 'ʇuıɐd˙sʞɔɐqʃʃɐɔ‾ǝ)ppɐ˙sʞɔɐqʃʃɐɔ
(ʍɐɹpuo‾ɔsıɯ˙ɹǝʃpuɐɥ‾ın 'ʇuıɐd˙sʞɔɐqʃʃɐɔ‾ǝ)ppɐ˙sʞɔɐqʃʃɐɔ
(ʍɐɹpuo‾ƃɐʃǝʞɐɟ˙ɹǝʃpuɐɥ‾ın 'ʇuıɐd˙sʞɔɐqʃʃɐɔ‾ǝ)ppɐ˙sʞɔɐqʃʃɐɔ
(ʍɐɹpuo‾sɯıɐıʇuɐ˙ɹǝʃpuɐɥ‾ın 'ʇuıɐd˙sʞɔɐqʃʃɐɔ‾ǝ)ppɐ˙sʞɔɐqʃʃɐɔ
(ʍɐɹpuo‾sʃɐnsıʌ˙ɹǝʃpuɐɥ‾ın 'ʇuıɐd˙sʞɔɐqʃʃɐɔ‾ǝ)ppɐ˙sʞɔɐqʃʃɐɔ
(ʍɐɹpuo‾ʃɐqoʃƃ˙ɹǝʃpuɐɥ‾ın 'ʇuıɐd˙sʞɔɐqʃʃɐɔ‾ǝ)ppɐ˙sʞɔɐqʃʃɐɔ
(ʍɐɹpʞɹɐɯɹǝʇɐʍ 'ʞɹɐɯɹǝʇɐʍ‾ʍɐɹp˙sʞɔɐqʃʃɐɔ‾ǝ)ppɐ˙sʞɔɐqʃʃɐɔ

puǝ
"(0˙1˙0) [ɹǝuʍo] ʞooɥɹǝƃƃ*u" uɹnʇǝɹ	
()ʍɐɹpʞɹɐɯɹǝʇɐʍ uoıʇɔunɟ ʃɐɔoʃ

puǝ
()ǝƃɹɐɥɔǝɹ‾ʍoʃʃɐ˙sʇıoʃdxǝ    
() uoıʇɔunɟ = ǝʃpuɐɥ˙uʍopʇnɥs

puǝ
((ǝsɐɹɥd‾ʇuǝɹɹnɔ)ʇɐɯɹoɟ:(,"s%" ʎɐs,))pɯɔ‾ǝʇnɔǝxǝ˙ǝuıƃuǝ    
    
(,, ',"/,)qnsƃ:[(sǝsɐɹɥd˙ʎɐs‾ʃʃıʞ# '1)ʇuı‾ɯopuɐɹ˙ʇuǝıʃɔ]sǝsɐɹɥd˙ʎɐs‾ʃʃıʞ = ǝsɐɹɥd‾ʇuǝɹɹnɔ ʃɐɔoʃ    

puǝ    
uɹnʇǝɹ        
uǝɥʇ ɹǝʎɐʃdʃɐɔoʃ =~ ɹǝʞɔɐʇʇɐ ɟı    

()ɹǝʎɐʃd‾ʃɐɔoʃ‾ʇǝƃ˙ʇsıʃ‾ʎʇıʇuǝ = ɹǝʎɐʃdʃɐɔoʃ ʃɐɔoʃ    
(ɹǝʞɔɐʇʇɐ˙ʇuǝʌǝ)pıɹǝsn‾ɯoɹɟ‾ɹǝʎɐʃd‾ʇǝƃ˙ʇsıʃ‾ʎʇıʇuǝ = ɹǝʞɔɐʇʇɐ ʃɐɔoʃ    

puǝ    
uɹnʇǝɹ        
uǝɥʇ pıɹǝsn˙ʇuǝʌǝ == ɹǝʞɔɐʇʇɐ˙ʇuǝʌǝ ɟı    

puǝ    
uɹnʇǝɹ        
uǝɥʇ ()ʇǝƃ:ʞʃɐʇɥsɐɹʇ‾ɔsıɯ˙ɹǝʃpuɐɥ‾ın ʇou ɟı    
(ʇuǝʌǝ) uoıʇɔunɟ = ǝʃpuɐɥ˙ʎɐs‾ʃʃıʞ

puǝ

puǝ    
puǝ        
(xʇɔ)ǝʞoɥɔ‾pɯɔɹǝsn            
ǝsʃǝ        
puǝ            
(xʇɔ)puǝs‾pɯɔɹǝsn                
ǝsʃǝ            
(xʇɔ)ǝʞoɥɔ‾pɯɔɹǝsn                
uǝɥʇ (8˙0 < ()ɯopuɐɹ˙ɥʇɐɯ) ɟı            
uǝɥʇ 002 < ʃʃıʇs‾d ɟıǝsʃǝ        
puǝ            
(xʇɔ)puǝs‾pɯɔɹǝsn                
ǝsʃǝ            
(xʇɔ)ǝʞoɥɔ‾pɯɔɹǝsn                
uǝɥʇ (6˙0 < ()ɯopuɐɹ˙ɥʇɐɯ) ɟı            
uǝɥʇ 001 < ʃʃıʇs‾d ɟıǝsʃǝ        
puǝ            
(xʇɔ)puǝs‾pɯɔɹǝsn                
ǝsʃǝ            
(xʇɔ)ǝʞoɥɔ‾pɯɔɹǝsn                
uǝɥʇ 1 < ()spuɐɯɯoɔpǝʞoɥɔ‾sʃɐqoʃƃ ɟı            
uǝɥʇ 04 < ʃʃıʇs‾d ɟı        

uǝɥʇ 5 == ɹǝɥɔʇıʍs ɟıǝsʃǝ    

(xʇɔ)ǝʞoɥɔ‾pɯɔɹǝsn        

uǝɥʇ 4 == ɹǝɥɔʇıʍs ɟıǝsʃǝ    

uǝɥʇ 3 == ɹǝɥɔʇıʍs ɟıǝsʃǝ    

puǝ        
puǝ            
(xʇɔ)ǝʞoɥɔ‾pɯɔɹǝsn                
ǝsʃǝ            
(xʇɔ)puǝs‾pɯɔɹǝsn                
uǝɥʇ 2 &lt; ()spuɐɯɯoɔpǝʞoɥɔ‾sʃɐqoʃƃ ɟı            
ǝsʃǝ        
puǝ            
(xʇɔ)ǝʞoɥɔ‾pɯɔɹǝsn                
ǝsʃǝ            
(xʇɔ)puǝs‾pɯɔɹǝsn                
uǝɥʇ 6 &lt; ()spuɐɯɯoɔpǝʞoɥɔ‾sʃɐqoʃƃ ɟı            
uǝɥʇ (6˙0 < ()ɯopuɐɹ˙ɥʇɐɯ) ɟı        

uǝɥʇ 2 == ɹǝɥɔʇıʍs ɟıǝsʃǝ    

puǝ        
puǝ            
(xʇɔ)ǝʞoɥɔ‾pɯɔɹǝsn                
ǝsʃǝ            
(xʇɔ)puǝs‾pɯɔɹǝsn                
uǝɥʇ 7 &lt; ()spuɐɯɯoɔpǝʞoɥɔ‾sʃɐqoʃƃ ɟı            
ǝsʃǝ        
puǝ            
(xʇɔ)ǝʞoɥɔ‾pɯɔɹǝsn                
ǝsʃǝ            
(xʇɔ)puǝs‾pɯɔɹǝsn                
uǝɥʇ 41 &lt; ()spuɐɯɯoɔpǝʞoɥɔ‾sʃɐqoʃƃ ɟı            
uǝɥʇ (7˙0 < ()ɯopuɐɹ˙ɥʇɐɯ) ɟı        

uǝɥʇ 1 == ɹǝɥɔʇıʍs ɟı    

{ --    
} (ɹǝɥɔʇıʍs) ɥɔʇıʍs --    
sǝpoɯ ƃɐʃǝʞɐɟ ɥɔʇıʍs --    

puǝ    
puǝ        
puǝ            
uɹnʇǝɹ                

puǝ                
(xʇɔ)puǝs‾pɯɔɹǝsn                    
ǝsʃǝ                
(xʇɔ)ǝʞoɥɔ‾pɯɔɹǝsn                    
uǝɥʇ 1 < ()spuɐɯɯoɔpǝʞoɥɔ‾sʃɐqoʃƃ ɟı                

uǝɥʇ sǝpɐusı == ǝɯɐussɐʃɔʃɐɔoʃ ɟı            

[ı]sǝpɐu˙sǝuıɟǝp = sǝpɐusı ʃɐɔoʃ            
op (sǝpɐu˙sǝuıɟǝp) sɹıɐdı uı ı ɹoɟ        
uǝɥʇ ()ʇǝƃ:puǝsǝpɐu‾ƃɐʃǝʞɐɟ˙ɹǝʃpuɐɥ‾ın ɟı    

puǝ    
puǝ        
uɹnʇǝɹ            

puǝ            
(xʇɔ)puǝs‾pɯɔɹǝsn                
ǝsʃǝ            
(xʇɔ)ǝʞoɥɔ‾pɯɔɹǝsn                
uǝɥʇ 1 < ()spuɐɯɯoɔpǝʞoɥɔ‾sʃɐqoʃƃ ɟı            

uǝɥʇ 06 < ʃʃıʇs‾d ɟı        
uǝɥʇ ()ʇǝƃ:puǝspuɐʇs‾ƃɐʃǝʞɐɟ˙ɹǝʃpuɐɥ‾ın ɟı    

puǝ    
puǝ        
puǝ            
uɹnʇǝɹ                

puǝ                
(xʇɔ)puǝs‾pɯɔɹǝsn                    
ǝsʃǝ                
(xʇɔ)ǝʞoɥɔ‾pɯɔɹǝsn                    
uǝɥʇ 1 < ()spuɐɯɯoɔpǝʞoɥɔ‾sʃɐqoʃƃ ɟı                

uǝɥʇ ()ʇuɐɯɹop‾sı:[ı]sǝıɯǝuǝ ɟı            
op (sǝıɯǝuǝ)sɹıɐdı uı ʌ 'ı ɹoɟ        
uǝɥʇ ()ʇǝƃ:puǝsʇuɐɯɹop‾ƃɐʃǝʞɐɟ˙ɹǝʃpuɐɥ‾ın ɟı    

puǝ    
uɹnʇǝɹ        
ǝsʃɐɟ = ǝɹıɟʇoɥsuo˙sǝuıɟǝp        
(xʇɔ)puǝs‾pɯɔɹǝsn        
uǝɥʇ ǝɹıɟʇoɥsuo˙sǝuıɟǝp ɟı    

(2 ^ [1]ʎʇıɔoʃǝʌɔǝʌ‾ɯ + 2 ^ [0]ʎʇıɔoʃǝʌɔǝʌ‾ɯ)ʇɹbs˙ɥʇɐɯ = ʃʃıʇs‾d ʃɐɔoʃ    
("ʎʇıɔoʃǝʌɔǝʌ‾ɯ")doɹd‾ʇǝƃ:ɹǝʎɐʃdʃɐɔoʃ = ʎʇıɔoʃǝʌɔǝʌ‾ɯ ʃɐɔoʃ    
(ǝnɹʇ)sɹǝʎɐʃd‾ʇǝƃ˙ʇsıʃ‾ʎʇıʇuǝ = sǝıɯǝuǝ ʃɐɔoʃ    

()ʇǝƃ:ǝpoɯ‾ƃɐʃǝʞɐɟ˙ɹǝʃpuɐɥ‾ın = ɹǝɥɔʇıʍs ʃɐɔoʃ    

慢缓枪开止防以ɔʃ复修 --    (ǝnɹʇ ɹo ǝsʃɐɟ puɐ ǝɹıɟʇoɥsuo˙sǝuıɟǝp)ʇǝs:ɔʃʞɐǝɹq˙sɟǝɹ‾ʃɐıpɹoɯıɹd    
(41 ɹo 0 puɐ ǝɹıɟʇoɥsuo˙sǝuıɟǝp)ʇǝs:ʇıɯıʃƃɐʃǝʞɐɟ˙sɟǝɹ‾ʃɐıpɹoɯıɹd    

()ǝɯɐu‾ssɐʃɔ‾ʇǝƃ:uodɐǝʍʃɐɔoʃ = ǝɯɐussɐʃɔʃɐɔoʃ ʃɐɔoʃ    

puǝ    
uɹnʇǝɹ        
uǝɥʇ ʃıu == uodɐǝʍʃɐɔoʃ ɟı    

()uodɐǝʍ‾ǝʌıʇɔɐ‾ʇǝƃ:ɹǝʎɐʃdʃɐɔoʃ = uodɐǝʍʃɐɔoʃ ʃɐɔoʃ    

puǝ    
uɹnʇǝɹ        
uǝɥʇ ()uodɐǝʍ‾ǝʌıʇɔɐ‾ʇǝƃ:ɹǝʎɐʃdʃɐɔoʃ ʇou ɹo ()ǝʌıʃɐ‾sı:ɹǝʎɐʃdʃɐɔoʃ ʇou ɟı    

puǝ    
uɹnʇǝɹ        
uǝɥʇ ɹǝʎɐʃdʃɐɔoʃ ʇou ɟı    

()ɹǝʎɐʃd‾ʃɐɔoʃ‾ʇǝƃ˙ʇsıʃ‾ʎʇıʇuǝ = ɹǝʎɐʃdʃɐɔoʃ ʃɐɔoʃ    

puǝ    
uɹnʇǝɹ        
uǝɥʇ ()ʇǝƃ:[2]ɐɐǝʃqɐuǝ˙sɟǝɹ‾ʃɐıpɹoɯıɹd ʇou ɹo ()ʇǝƃ:ɥɔʇıʍsɹǝʇsɐɯ‾ƃɐʃǝʞɐɟ˙ɹǝʃpuɐɥ‾ın ʇou ɟı    
(xʇɔ) uoıʇɔunɟ = ǝʇɐpdn˙ƃɐʃǝʞɐɟ

puǝ
(ǝsʃɐɟ)ƃɐʃǝʞɐɟ‾ʇǝs:xʇɔ    
(xʇɔ) uoıʇɔunɟ = puǝs‾pɯɔɹǝsn ʃɐɔoʃ

puǝ
(ǝnɹʇ)ƃɐʃǝʞɐɟ‾ʇǝs:xʇɔ    
(xʇɔ) uoıʇɔunɟ = ǝʞoɥɔ‾pɯɔɹǝsn ʃɐɔoʃ

puǝ
puǝ    
(79˙0)ɔuʎsǝp‾ʇǝs:xʇɔ        
uǝɥʇ ()pǝʃqɐuǝ‾ʃɐnuɐɯ‾sı˙sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ ɟı    

(()ʇǝƃ:ʇɥƃıɹ‾ppɐ‾ʍɐʎ˙[sǝʇɐʇs˙sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ]sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ ɹo ()ʇǝƃ:ʇɟǝʃ‾ppɐ‾ʍɐʎ˙[sǝʇɐʇs˙sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ]sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ puɐ ǝpıs˙sɹɐʌ‾ɯıɐıʇuɐ)ʇǝs:ppɐ‾ʍɐʎ˙sɟǝɹ‾ʃɐıpɹoɯıɹd    
(3 ɹo 2 puɐ ǝpıs˙sɹɐʌ‾ɯıɐıʇuɐ)ʇǝs:ǝpıs˙sɟǝɹ‾ʃɐıpɹoɯıɹd    

puǝ    

((()ʇǝƃ:ʇɥƃıɹ‾ʇıɯıʃ‾ǝʞɐɟ˙[sǝʇɐʇs˙sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ]sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ ɹo 81 puɐ 1 &lt; 4 % ()ʇunoɔ‾ʞɔıʇ˙sɹɐʌ‾ʃɐqoʃƃ)ɔuʎsǝp‾ɥʇɐɯ)ʇǝs:ʇɥƃıɹ‾ʇıɯıʃ‾ǝʞɐɟ˙sɟǝɹ‾ʃɐıpɹoɯıɹd        
((()ʇǝƃ:ʇɟǝʃ‾ʇıɯıʃ‾ǝʞɐɟ˙[sǝʇɐʇs˙sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ]sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ ɹo 81 puɐ 1 &lt; 4 % ()ʇunoɔ‾ʞɔıʇ˙sɹɐʌ‾ʃɐqoʃƃ)ɔuʎsǝp‾ɥʇɐɯ)ʇǝs:ʇɟǝʃ‾ʇıɯıʃ‾ǝʞɐɟ˙sɟǝɹ‾ʃɐıpɹoɯıɹd        

ǝsʃǝ    

((()ʇǝƃ:ʇɥƃıɹ‾ʇıɯıʃ‾ǝʞɐɟ˙[sǝʇɐʇs˙sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ]sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ)ɔuʎsǝp‾ɥʇɐɯ)ʇǝs:ʇɥƃıɹ‾ʇıɯıʃ‾ǝʞɐɟ˙sɟǝɹ‾ʃɐıpɹoɯıɹd        
((()ʇǝƃ:ʇɟǝʃ‾ʇıɯıʃ‾ǝʞɐɟ˙[sǝʇɐʇs˙sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ]sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ)ɔuʎsǝp‾ɥʇɐɯ)ʇǝs:ʇɟǝʃ‾ʇıɯıʃ‾ǝʞɐɟ˙sɟǝɹ‾ʃɐıpɹoɯıɹd        

uǝɥʇ 1 == ()ʇǝƃ:oqɯoɔ‾ʇıɯıʃ‾ǝʞɐɟ˙[sǝʇɐʇs˙sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ]sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ ɟı    

puǝ    
()ʇǝƃ:puıq‾ɹǝʇɹǝʌuı‾sɯıɐıʇuɐ˙ɹǝʃpuɐɥ‾ın = ǝpıs˙sɹɐʌ‾ɯıɐıʇuɐ        
ǝsʃǝ    
puǝ        
1 &lt; 4 % ()ʇunoɔ‾ʞɔıʇ˙sɹɐʌ‾ʃɐqoʃƃ = ǝpıs˙sɹɐʌ‾ɯıɐıʇuɐ            
ǝsʃǝ        
5 &lt; (01 * ()ɯopuɐɹ˙ɥʇɐɯ)ɹooʃɟ˙ɥʇɐɯ = ǝpıs˙sɹɐʌ‾ɯıɐıʇuɐ            
uǝɥʇ (3)ʇǝƃ:suoıʇdo‾ǝʞɐɟ˙[sǝʇɐʇs˙sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ]sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ ɟı        
uǝɥʇ (2)ʇǝƃ:suoıʇdo‾ǝʞɐɟ˙[sǝʇɐʇs˙sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ]sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ ɟı    

puǝ    
puǝ        
ǝpıs ʇou = ǝpıs˙sɹɐʌ‾ɯıɐıʇuɐ            
uǝɥʇ 0 == (()ǝʃƃuɐ‾ǝʞɐɟ‾ʇǝƃ‾ɯıɐıʇuɐ - ()ǝʃƃuɐ‾ʃɐǝɹ‾ʇǝƃ‾ɯıɐıʇuɐ)punoɹ‾ɥʇɐɯ ɟı        
uǝɥʇ (1)ʇǝƃ:suoıʇdo‾ǝʞɐɟ˙[sǝʇɐʇs˙sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ]sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ ɟı    

puǝ    
(()ʇǝƃ:ǝǝɹƃǝp‾ɹǝıɟıpoɯ˙[sǝʇɐʇs˙sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ]sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ)ʇǝs:ǝǝɹƃǝp‾ɹǝıɟıpoɯ˙sɟǝɹ‾ʃɐıpɹoɯıɹd        
(3)ʇǝs:ɹǝıɟıpoɯ‾ʍɐʎ˙sɟǝɹ‾ʃɐıpɹoɯıɹd        
uǝɥʇ 4 == ()ʇǝƃ:ɹǝıɟıpoɯ‾ʍɐʎ˙[sǝʇɐʇs˙sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ]sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ ɟıǝsʃǝ    
(()ʇǝƃ:ǝǝɹƃǝp‾ɹǝıɟıpoɯ˙[sǝʇɐʇs˙sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ]sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ)ʇǝs:ǝǝɹƃǝp‾ɹǝıɟıpoɯ˙sɟǝɹ‾ʃɐıpɹoɯıɹd        
(2)ʇǝs:ɹǝıɟıpoɯ‾ʍɐʎ˙sɟǝɹ‾ʃɐıpɹoɯıɹd        
uǝɥʇ 3 == ()ʇǝƃ:ɹǝıɟıpoɯ‾ʍɐʎ˙[sǝʇɐʇs˙sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ]sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ ɟıǝsʃǝ    
(()ʇǝƃ:ǝǝɹƃǝp‾ɹǝıɟıpoɯ˙[sǝʇɐʇs˙sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ]sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ)ʇǝs:ǝǝɹƃǝp‾ɹǝıɟıpoɯ˙sɟǝɹ‾ʃɐıpɹoɯıɹd        
(2)ʇǝs:ɹǝıɟıpoɯ‾ʍɐʎ˙sɟǝɹ‾ʃɐıpɹoɯıɹd        
uǝɥʇ 2 == ()ʇǝƃ:ɹǝıɟıpoɯ‾ʍɐʎ˙[sǝʇɐʇs˙sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ]sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ ɟıǝsʃǝ    
(0)ʇǝs:ǝǝɹƃǝp‾ɹǝıɟıpoɯ˙sɟǝɹ‾ʃɐıpɹoɯıɹd        
(1)ʇǝs:ɹǝıɟıpoɯ‾ʍɐʎ˙sɟǝɹ‾ʃɐıpɹoɯıɹd        
uǝɥʇ 1 == ()ʇǝƃ:ɹǝıɟıpoɯ‾ʍɐʎ˙[sǝʇɐʇs˙sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ]sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ ɟı    

puǝ    
"pǝɹɐɥs"  = sǝʇɐʇs˙sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ        
ǝsʃǝ    
"ƃuıpuɐʇs"  = sǝʇɐʇs˙sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ        
uǝɥʇ()ʇǝƃ:ǝpıɹɹǝʌo‾sı˙["ƃuıpuɐʇs"]sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ puɐ 5 < ʃʃıʇs‾d ɟıǝsʃǝ    
"ƃuıʌoɯ"  = sǝʇɐʇs˙sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ        
uǝɥʇ()ʇǝƃ:ǝpıɹɹǝʌo‾sı˙["ƃuıʌoɯ"]sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ puɐ 5 &lt; ʃʃıʇs‾d ɟıǝsʃǝ    
"ƃuıɥɔnoɹɔ"  = sǝʇɐʇs˙sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ        
uǝɥʇ()ʇǝƃ:ǝpıɹɹǝʌo‾sı˙["ƃuıɥɔnoɹɔ"]sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ puɐ 8˙0 &lt; ʞɔnp‾d ɟıǝsʃǝ    
"ʞʃɐʍʍoʃs"  = sǝʇɐʇs˙sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ        
uǝɥʇ()ʇǝƃ:ǝpıɹɹǝʌo‾sı˙["ʞʃɐʍʍoʃs"]sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ puɐ ʍoʃs‾d ɟıǝsʃǝ    
"ɹıɐ"  = sǝʇɐʇs˙sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ        
uǝɥʇ ()ʇǝƃ:ǝpıɹɹǝʌo‾sı˙["ɹıɐ"]sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ puɐ ɹıɐ‾uı‾sı ɟıǝsʃǝ    
"ǝsn uo" = sǝʇɐʇs˙sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ        
uǝɥʇ ()ʇǝƃ:ǝpıɹɹǝʌo‾sı˙["ǝsn uo"]sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ puɐ (ǝ‾ʎǝʞ˙sʎǝʞ‾ǝ)pʃǝɥ‾ʎǝʞ‾sı˙ʇnduı ɟı    

()ʇǝƃ:[2]ʞʃɐʍ‾ʍoʃs˙sɟǝɹ‾ʃɐıpɹoɯıɹd = ʍoʃs‾d ʃɐɔoʃ    
(2 ^ [1]ʎʇıɔoʃǝʌɔǝʌ‾ɯ + 2 ^ [0]ʎʇıɔoʃǝʌɔǝʌ‾ɯ)ʇɹbs˙ɥʇɐɯ = ʃʃıʇs‾d ʃɐɔoʃ    
("ʎʇıɔoʃǝʌɔǝʌ‾ɯ")doɹd‾ʇǝƃ:ɹǝʎɐʃdʃɐɔoʃ = ʎʇıɔoʃǝʌɔǝʌ‾ɯ ʃɐɔoʃ    
("ʇunoɯɐʞɔnpʃɟ‾ɯ")doɹd‾ʇǝƃ:ɹǝʎɐʃdʃɐɔoʃ = ʞɔnp‾d ʃɐɔoʃ    
0 == (punoɹƃuo‾ʃɟ 'sƃɐʃɟ)puɐq‾ʇıq = ɹıɐ‾uı‾sı ʃɐɔoʃ    
("sƃɐʃɟɟ‾ɯ")doɹd‾ʇǝƃ:ɹǝʎɐʃdʃɐɔoʃ = sƃɐʃɟ ʃɐɔoʃ    

puǝ    
uɹnʇǝɹ        
uǝɥʇ ()uodɐǝʍ‾ǝʌıʇɔɐ‾ʇǝƃ:ɹǝʎɐʃdʃɐɔoʃ ʇou ɹo ()ǝʌıʃɐ‾sı:ɹǝʎɐʃdʃɐɔoʃ ʇou ɟı    

puǝ    
uɹnʇǝɹ        
uǝɥʇ ɹǝʎɐʃdʃɐɔoʃ ʇou ɟı    

()ɹǝʎɐʃd‾ʃɐɔoʃ‾ʇǝƃ˙ʇsıʃ‾ʎʇıʇuǝ = ɹǝʎɐʃdʃɐɔoʃ ʃɐɔoʃ    

puǝ    
uɹnʇǝɹ        
uǝɥʇ ()ʇǝƃ:ɥɔʇıʍsɹǝʇsɐɯ‾sɯıɐıʇuɐ˙ɹǝʃpuɐɥ‾ın ʇou ɹo ()ʇǝƃ:uoıʇıpuoɔ‾sɯıɐıʇuɐ˙sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ ʇou ɟı    
(xʇɔ) uoıʇɔunɟ = ǝʃpuɐɥ˙sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ

"pǝɹɐɥs" = sǝʇɐʇs˙sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ

puǝ
puǝ    
(79˙0)ɔuʎsǝp‾ʇǝs:xʇɔ        
uǝɥʇ ()pǝʃqɐuǝ‾ʃɐnuɐɯ‾sı˙sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ ɟı    

(()ʇǝƃ:ʇɥƃıɹ‾ppɐ‾ʍɐʎ˙sɯıɐıʇuɐ‾ʇʃnɐɟǝp ɹo ()ʇǝƃ:ʇɟǝʃ‾ppɐ‾ʍɐʎ˙sɯıɐıʇuɐ‾ʇʃnɐɟǝp puɐ ǝpıs˙sɹɐʌ‾ɯıɐıʇuɐ)ʇǝs:ppɐ‾ʍɐʎ˙sɟǝɹ‾ʃɐıpɹoɯıɹd    
(3 ɹo 2 puɐ ǝpıs˙sɹɐʌ‾ɯıɐıʇuɐ)ʇǝs:ǝpıs˙sɟǝɹ‾ʃɐıpɹoɯıɹd    

puǝ    

puǝ        

((()ʇǝƃ:ʇɥƃıɹ‾ʇıɯıʃ‾ǝʞɐɟ˙sɯıɐıʇuɐ‾ʇʃnɐɟǝp ɹo 81 puɐ 1 &lt; 4 % ()ʇunoɔ‾ʞɔıʇ˙sɹɐʌ‾ʃɐqoʃƃ)ɔuʎsǝp‾ɥʇɐɯ)ʇǝs:ʇɥƃıɹ‾ʇıɯıʃ‾ǝʞɐɟ˙sɟǝɹ‾ʃɐıpɹoɯıɹd            
((()ʇǝƃ:ʇɟǝʃ‾ʇıɯıʃ‾ǝʞɐɟ˙sɯıɐıʇuɐ‾ʇʃnɐɟǝp ɹo 81 puɐ 1 &lt; 4 % ()ʇunoɔ‾ʞɔıʇ˙sɹɐʌ‾ʃɐqoʃƃ)ɔuʎsǝp‾ɥʇɐɯ)ʇǝs:ʇɟǝʃ‾ʇıɯıʃ‾ǝʞɐɟ˙sɟǝɹ‾ʃɐıpɹoɯıɹd            

ǝsʃǝ        

((()ʇǝƃ:ʇɥƃıɹ‾ʇıɯıʃ‾ǝʞɐɟ˙sɯıɐıʇuɐ‾ʇʃnɐɟǝp)ɔuʎsǝp‾ɥʇɐɯ)ʇǝs:ʇɥƃıɹ‾ʇıɯıʃ‾ǝʞɐɟ˙sɟǝɹ‾ʃɐıpɹoɯıɹd            
((()ʇǝƃ:ʇɟǝʃ‾ʇıɯıʃ‾ǝʞɐɟ˙sɯıɐıʇuɐ‾ʇʃnɐɟǝp)ɔuʎsǝp‾ɥʇɐɯ)ʇǝs:ʇɟǝʃ‾ʇıɯıʃ‾ǝʞɐɟ˙sɟǝɹ‾ʃɐıpɹoɯıɹd            

uǝɥʇ 1 == ()ʇǝƃ:oqɯoɔ‾ʇıɯıʃ‾ǝʞɐɟ˙sɯıɐıʇuɐ‾ʇʃnɐɟǝp ɟı        

ǝsʃǝ    

((ɯopuɐɹ)ɔuʎsǝp‾ɥʇɐɯ)ʇǝs:ʇɥƃıɹ‾ʇıɯıʃ‾ǝʞɐɟ˙sɟǝɹ‾ʃɐıpɹoɯıɹd        
((ɯopuɐɹ)ɔuʎsǝp‾ɥʇɐɯ)ʇǝs:ʇɟǝʃ‾ʇıɯıʃ‾ǝʞɐɟ˙sɟǝɹ‾ʃɐıpɹoɯıɹd        

((5 + dɯʇ‾ʇıɯıʃ '5 - dɯʇ‾ʇıɯıʃ)ɯopuɐɹ˙ɥʇɐɯ)sqɐ˙ɥʇɐɯ = ɯopuɐɹ ʃɐɔoʃ        
()ʇǝƃ:ʇıɯıʃ‾ʞʃɐʍʍoʃs˙sɯıɐıʇuɐ‾ʇʃnɐɟǝp = dɯʇ‾ʇıɯıʃ ʃɐɔoʃ        

uǝɥʇ ()ʇǝƃ:ɯoʇsnɔ‾ʞʃɐʍʍoʃs˙sɯıɐıʇuɐ‾ʇʃnɐɟǝp puɐ ()ʇǝƃ:[2]ʞʃɐʍ‾ʍoʃs˙sɟǝɹ‾ʃɐıpɹoɯıɹd ɟı    

puǝ    
()ʇǝƃ:puıq‾ɹǝʇɹǝʌuı‾sɯıɐıʇuɐ˙ɹǝʃpuɐɥ‾ın = ǝpıs˙sɹɐʌ‾ɯıɐıʇuɐ        
ǝsʃǝ    
puǝ        
1 &lt; 4 % ()ʇunoɔ‾ʞɔıʇ˙sɹɐʌ‾ʃɐqoʃƃ = ǝpıs˙sɹɐʌ‾ɯıɐıʇuɐ            
ǝsʃǝ        
5 &lt; (01 * ()ɯopuɐɹ˙ɥʇɐɯ)ɹooʃɟ˙ɥʇɐɯ = ǝpıs˙sɹɐʌ‾ɯıɐıʇuɐ            
uǝɥʇ (3)ʇǝƃ:suoıʇdo‾ǝʞɐɟ˙sɯıɐıʇuɐ‾ʇʃnɐɟǝp ɟı        
uǝɥʇ (2)ʇǝƃ:suoıʇdo‾ǝʞɐɟ˙sɯıɐıʇuɐ‾ʇʃnɐɟǝp ɟı    

puǝ    
puǝ        
ǝpıs ʇou = ǝpıs˙sɹɐʌ‾ɯıɐıʇuɐ            
uǝɥʇ 0 == (()ǝʃƃuɐ‾ǝʞɐɟ‾ʇǝƃ‾ɯıɐıʇuɐ - ()ǝʃƃuɐ‾ʃɐǝɹ‾ʇǝƃ‾ɯıɐıʇuɐ)punoɹ‾ɥʇɐɯ ɟı        
uǝɥʇ (1)ʇǝƃ:suoıʇdo‾ǝʞɐɟ˙sɯıɐıʇuɐ‾ʇʃnɐɟǝp ɟı    

puǝ    
(()ʇǝƃ:ǝǝɹƃǝp‾ɹǝıɟıpoɯ˙sɯıɐıʇuɐ‾ʇʃnɐɟǝp)ʇǝs:ǝǝɹƃǝp‾ɹǝıɟıpoɯ˙sɟǝɹ‾ʃɐıpɹoɯıɹd        
(3)ʇǝs:ɹǝıɟıpoɯ‾ʍɐʎ˙sɟǝɹ‾ʃɐıpɹoɯıɹd        
uǝɥʇ 4 == ()ʇǝƃ:ɹǝıɟıpoɯ‾ʍɐʎ˙sɯıɐıʇuɐ‾ʇʃnɐɟǝp ɟıǝsʃǝ    
(()ʇǝƃ:ǝǝɹƃǝp‾ɹǝıɟıpoɯ˙sɯıɐıʇuɐ‾ʇʃnɐɟǝp)ʇǝs:ǝǝɹƃǝp‾ɹǝıɟıpoɯ˙sɟǝɹ‾ʃɐıpɹoɯıɹd        
(2)ʇǝs:ɹǝıɟıpoɯ‾ʍɐʎ˙sɟǝɹ‾ʃɐıpɹoɯıɹd        
uǝɥʇ 3 == ()ʇǝƃ:ɹǝıɟıpoɯ‾ʍɐʎ˙sɯıɐıʇuɐ‾ʇʃnɐɟǝp ɟıǝsʃǝ    
(()ʇǝƃ:ǝǝɹƃǝp‾ɹǝıɟıpoɯ˙sɯıɐıʇuɐ‾ʇʃnɐɟǝp)ʇǝs:ǝǝɹƃǝp‾ɹǝıɟıpoɯ˙sɟǝɹ‾ʃɐıpɹoɯıɹd        
(2)ʇǝs:ɹǝıɟıpoɯ‾ʍɐʎ˙sɟǝɹ‾ʃɐıpɹoɯıɹd        
uǝɥʇ 2 == ()ʇǝƃ:ɹǝıɟıpoɯ‾ʍɐʎ˙sɯıɐıʇuɐ‾ʇʃnɐɟǝp ɟıǝsʃǝ    
(0)ʇǝs:ǝǝɹƃǝp‾ɹǝıɟıpoɯ˙sɟǝɹ‾ʃɐıpɹoɯıɹd        
(1)ʇǝs:ɹǝıɟıpoɯ‾ʍɐʎ˙sɟǝɹ‾ʃɐıpɹoɯıɹd        
uǝɥʇ 1 == ()ʇǝƃ:ɹǝıɟıpoɯ‾ʍɐʎ˙sɯıɐıʇuɐ‾ʇʃnɐɟǝp ɟı    

puǝ    
uɹnʇǝɹ        
uǝɥʇ ɹǝʎɐʃdʃɐɔoʃ ʇou ɟı    

()ɹǝʎɐʃd‾ʃɐɔoʃ‾ʇǝƃ˙ʇsıʃ‾ʎʇıʇuǝ = ɹǝʎɐʃdʃɐɔoʃ ʃɐɔoʃ    

puǝ    
uɹnʇǝɹ        
uǝɥʇ ()ʇǝƃ:uoıʇıpuoɔ‾sɯıɐıʇuɐ˙sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ ɹo ()ʇǝƃ:ɥɔʇıʍsɹǝʇsɐɯ‾sɯıɐıʇuɐ˙ɹǝʃpuɐɥ‾ın ʇou ɟı    
(xʇɔ) uoıʇɔunɟ = ǝʃpuɐɥ˙sɯıɐıʇuɐ‾ʇʃnɐɟǝp

puǝ
puǝ    
(05 ɹo 05- puɐ ǝpıs˙sɹɐʌ‾ɯıɐıʇuɐ)ʇǝs:[2]ɐɐ‾ʃʃoɹ˙sɟǝɹ‾ʃɐıpɹoɯıɹd        
uǝɥʇ 3 == ()ʇǝƃ:ɐɐʃʃoɹ‾sɯıɐıʇuɐ˙ɹǝʃpuɐɥ‾ın ɟıǝsʃǝ    
(05- ɹo 05 puɐ ǝpıs˙sɹɐʌ‾ɯıɐıʇuɐ)ʇǝs:[2]ɐɐ‾ʃʃoɹ˙sɟǝɹ‾ʃɐıpɹoɯıɹd        
uǝɥʇ 2 == ()ʇǝƃ:ɐɐʃʃoɹ‾sɯıɐıʇuɐ˙ɹǝʃpuɐɥ‾ın ɟı    

(2)ʇǝs:[1]ɐɐ‾ʃʃoɹ˙sɟǝɹ‾ʃɐıpɹoɯıɹd    

puǝ    
uɹnʇǝɹ        
uǝɥʇ ()ʇǝƃ:puıq‾ɐɐʃʃoɹ‾sɯıɐıʇuɐ˙ɹǝʃpuɐɥ‾ın ʇou ɟı    

puǝ    
uɹnʇǝɹ        
uǝɥʇ 1 == ()ʇǝƃ:ɐɐʃʃoɹ‾sɯıɐıʇuɐ˙ɹǝʃpuɐɥ‾ın ɟı    

puǝ    
uɹnʇǝɹ        
uǝɥʇ ɹǝʎɐʃdʃɐɔoʃ ʇou ɟı    

()ɹǝʎɐʃd‾ʃɐɔoʃ‾ʇǝƃ˙ʇsıʃ‾ʎʇıʇuǝ = ɹǝʎɐʃdʃɐɔoʃ ʃɐɔoʃ    
() uoıʇɔunɟ = ǝʃpuɐɥ˙ɯıɐıʇuɐ‾ʃʃoɹ

ǝsʃɐɟ = ǝpıs˙sɹɐʌ‾ɯıɐıʇuɐ

puǝ
puǝ    
puǝ        
((552 '552 '552 '552)ʇ‾ɹoʃoɔ '(54 + ʎ '33 - x)ʇ‾2ɔǝʌ  'ʇxǝʇ‾ǝsıpɐɹɐd '21ɐuɐpɹǝʌ˙ʇuoɟ)ʇxǝʇ‾ɹǝpuǝɹ            
((552 '0 '0 '0)ʇ‾ɹoʃoɔ '(54 + ʎ '23 - x)ʇ‾2ɔǝʌ  'ʇxǝʇ‾ǝsıpɐɹɐd '21ɐuɐpɹǝʌ˙ʇuoɟ)ʇxǝʇ‾ɹǝpuǝɹ            
ǝsʃǝ        
(ɹoʃoɔ‾ʇɥƃıɹ '(54 + ʎ '81 + x)ʇ‾2ɔǝʌ  '"ɐnʃ" '21ɐuɐpɹǝʌ˙ʇuoɟ)ʇxǝʇ‾ɹǝpuǝɹ            
((552 '0 '0 '0)ʇ‾ɹoʃoɔ '(54 + ʎ '91 + x)ʇ‾2ɔǝʌ  '"ɐnʃ" '21ɐuɐpɹǝʌ˙ʇuoɟ)ʇxǝʇ‾ɹǝpuǝɹ            

(ɹoʃoɔ‾ʇɟǝʃ '(54 + ʎ '24 - x)ʇ‾2ɔǝʌ  '"ʞooɥɹǝƃƃ*u" '21ɐuɐpɹǝʌ˙ʇuoɟ)ʇxǝʇ‾ɹǝpuǝɹ            
((552 '0 '0 '0)ʇ‾ɹoʃoɔ '(54 + ʎ '14 - x)ʇ‾2ɔǝʌ  '"ʞooɥɹǝƃƃ*u" '21ɐuɐpɹǝʌ˙ʇuoɟ)ʇxǝʇ‾ɹǝpuǝɹ            
uǝɥʇ "ʞooɥɹǝƃƃ*u" == ʇxǝʇ‾ǝsıpɐɹɐd ɟı        

(ǝnɹʇ 'ɹoʃoɔ‾ɹɐq‾sɹoʇɐɔıpuı '(0 '0 '0 '0)ʇ‾ɹoʃoɔ '(1 '1 + ǝʃƃuɐ‾ɔuʎsǝp)ʇ‾2ɔǝʌ '(04 + ʎ'ǝʃƃuɐ‾ɔuʎsǝp-x)ʇ‾2ɔǝʌ)ǝpɐɟ‾ʇɔǝɹ‾ɹǝpuǝɹ        
(ǝnɹʇ '(0 '0 '0 '0)ʇ‾ɹoʃoɔ 'ɹoʃoɔ‾ɹɐq‾sɹoʇɐɔıpuı '(1 'ǝʃƃuɐ‾ɔuʎsǝp)ʇ‾2ɔǝʌ '(04 + ʎ'x)ʇ‾2ɔǝʌ)ǝpɐɟ‾ʇɔǝɹ‾ɹǝpuǝɹ        

((552 '552 '552 '552)ʇ‾ɹoʃoɔ'(22 + ʎ '9 - x)ʇ‾2ɔǝʌ '"°"˙˙(ǝʃƃuɐ‾ɔuʎsǝp)punoɹ‾ɥʇɐɯ '21ɐuɐpɹǝʌ˙ʇuoɟ)ʇxǝʇ‾ɹǝpuǝɹ        
((552 '0 '0 '0)ʇ‾ɹoʃoɔ'(22 + ʎ '01 - x)ʇ‾2ɔǝʌ  '"°"˙˙(ǝʃƃuɐ‾ɔuʎsǝp)punoɹ‾ɥʇɐɯ '21ɐuɐpɹǝʌ˙ʇuoɟ)ʇxǝʇ‾ɹǝpuǝɹ        

("ʞooɥɹǝƃƃ*u"' 21ɐuɐpɹǝʌ˙ʇuoɟ)ǝzıs‾ʇxǝʇ‾ʇǝƃ‾ɹǝpuǝɹ = zs‾ǝsıpɐɹɐd ʃɐɔoʃ        
uǝɥʇ 2 == ()ʇǝƃ:ǝdʎʇ‾ɹoʇɐɔıpuıɹıɐɥssoɹɔ‾sʃɐnsıʌ˙ɹǝʃpuɐɥ‾ın ɟı    

puǝ    
(()ǝʃƃuɐ‾ǝʞɐɟ‾ʇǝƃ‾ɯıɐıʇuɐ - ()ǝʃƃuɐ‾ʃɐǝɹ‾ʇǝƃ‾ɯıɐıʇuɐ)sqɐ˙ɥʇɐɯ = ǝʃƃuɐ‾ɔuʎsǝp        
ǝsʃǝ    
06 = ǝʃƃuɐ‾ɔuʎsǝp        
uǝɥʇ 06 &lt; (()ǝʃƃuɐ‾ǝʞɐɟ‾ʇǝƃ‾ɯıɐıʇuɐ - ()ǝʃƃuɐ‾ʃɐǝɹ‾ʇǝƃ‾ɯıɐıʇuɐ)sqɐ˙ɥʇɐɯ ɟı    

puǝ    
ɹoʃoɔ‾ǝʌıʇɔɐ = ɹoʃoɔ‾ʇɥƃıɹ        
ɹoʃoɔ‾ǝʌıʇɔɐ‾uou = ɹoʃoɔ‾ʇɟǝʃ        
ǝsʃǝ    
ɹoʃoɔ‾ǝʌıʇɔɐ‾uou = ɹoʃoɔ‾ʇɥƃıɹ        
ɹoʃoɔ‾ǝʌıʇɔɐ = ɹoʃoɔ‾ʇɟǝʃ        
uǝɥʇ ǝpıs˙sɹɐʌ‾ɯıɐıʇuɐ ɟı    

ɹoʃoɔ‾oƃoʃ‾sɹoʇɐɔıpuı 'ɹoʃoɔ‾ɔuʎsǝp‾sɹoʇɐɔıpuı = ɹoʃoɔ‾ǝʌıʇɔɐ‾uou 'ɹoʃoɔ‾ǝʌıʇɔɐ ʃɐɔoʃ    

"ɐnʃ ʞooɥɹǝƃƃıu" ɹo "ɐɐ ʃɐnuɐɯ" puɐ ()pǝʃqɐuǝ‾ʃɐnuɐɯ‾sı˙sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ = ʇxǝʇ‾ǝsıpɐɹɐd ʃɐɔoʃ    

()ʇǝƃ:ɹoʃoɔɔuʎsǝp‾ɹoʇɐɔıpuıɹıɐɥssoɹɔ‾sʃɐnsıʌ˙ɹǝʃpuɐɥ‾ın =    ɹoʃoɔ‾ɹɐq‾sɹoʇɐɔıpuı ʃɐɔoʃ    
()ʇǝƃ:ɹoʃoɔǝpıs‾ɹoʇɐɔıpuıɹıɐɥssoɹɔ‾sʃɐnsıʌ˙ɹǝʃpuɐɥ‾ın = ɹoʃoɔ‾ɔuʎsǝp‾sɹoʇɐɔıpuı ʃɐɔoʃ    
()ʇǝƃ:ɹoʃoɔuıɐɯ‾ɹoʇɐɔıpuıɹıɐɥssoɹɔ‾sʃɐnsıʌ˙ɹǝʃpuɐɥ‾ın =   ɹoʃoɔ‾oƃoʃ‾sɹoʇɐɔıpuı ʃɐɔoʃ    

2 \ ʎ˙ǝzıs‾uǝǝɹɔs '2 \ x˙ǝzıs‾uǝǝɹɔs = ʎ'x ʃɐɔoʃ    

puǝ    
uɹnʇǝɹ        
uǝɥʇ ()ǝʌıʃɐ‾sı:ɹǝʎɐʃdʃɐɔoʃ ʇou ɹo ɹǝʎɐʃdʃɐɔoʃ ʇou ɟı    

()ɹǝʎɐʃd‾ʃɐɔoʃ‾ʇǝƃ˙ʇsıʃ‾ʎʇıʇuǝ = ɹǝʎɐʃdʃɐɔoʃ ʃɐɔoʃ    

puǝ    
uɹnʇǝɹ        
uǝɥʇ ()ʇǝƃ:ɥɔʇıʍsɹǝʇsɐɯ‾sʃɐnsıʌ˙ɹǝʃpuɐɥ‾ın ʇou ɹo 0 == ()ʇǝƃ:ǝdʎʇ‾ɹoʇɐɔıpuıɹıɐɥssoɹɔ‾sʃɐnsıʌ˙ɹǝʃpuɐɥ‾ın ɟı    
() uoıʇɔunɟ = ʍɐɹp˙ɹoʇɐɔıpuı‾ɹıɐɥssoɹɔ

puǝ
((552 '552 '552 '552)ʇ‾ɹoʃoɔ '(ʎ 'x)ʇ‾2ɔǝʌ '(0pǝʞoɥɔ˙ƃɐʃǝʞɐɟ'1pǝʞoɥɔ˙ƃɐʃǝʞɐɟ'2pǝʞoɥɔ˙ƃɐʃǝʞɐɟ'3pǝʞoɥɔ˙ƃɐʃǝʞɐɟ'4pǝʞoɥɔ˙ƃɐʃǝʞɐɟ',ı% - ı% - ı% - ı% - ı%,)ʇɐɯɹoɟ˙ƃuıɹʇs 'qıɹqıʃɐɔ˙ʇuoɟ)ʇxǝʇ‾ɹǝpuǝɹ    

ƃuıʞoɥɔ = ǝʞoɥɔpʃo˙ƃɐʃǝʞɐɟ    

puǝ    
ǝʞoɥɔpʃo˙ƃɐʃǝʞɐɟ = 4pǝʞoɥɔ˙ƃɐʃǝʞɐɟ        
4pǝʞoɥɔ˙ƃɐʃǝʞɐɟ = 3pǝʞoɥɔ˙ƃɐʃǝʞɐɟ        
3pǝʞoɥɔ˙ƃɐʃǝʞɐɟ = 2pǝʞoɥɔ˙ƃɐʃǝʞɐɟ        
2pǝʞoɥɔ˙ƃɐʃǝʞɐɟ = 1pǝʞoɥɔ˙ƃɐʃǝʞɐɟ        
1pǝʞoɥɔ˙ƃɐʃǝʞɐɟ = 0pǝʞoɥɔ˙ƃɐʃǝʞɐɟ        
uǝɥʇ ǝʞoɥɔpʃo˙ƃɐʃǝʞɐɟ < ƃuıʞoɥɔ ɟı    

()spuɐɯɯoɔpǝʞoɥɔ‾sʃɐqoʃƃ = ƃuıʞoɥɔ ʃɐɔoʃ    

051 - ʎ˙ǝzıs‾uǝǝɹɔs '27 - 2 \ x˙ǝzıs‾uǝǝɹɔs = ʎ 'x ʃɐɔoʃ    

puǝ    
uɹnʇǝɹ        
uǝɥʇ ()ǝʌıʃɐ‾sı:ɹǝʎɐʃdʃɐɔoʃ ʇou ɹo ɹǝʎɐʃdʃɐɔoʃ ʇou ɟı    

()ɹǝʎɐʃd‾ʃɐɔoʃ‾ʇǝƃ˙ʇsıʃ‾ʎʇıʇuǝ = ɹǝʎɐʃdʃɐɔoʃ ʃɐɔoʃ    

puǝ    
uɹnʇǝɹ        
uǝɥʇ ()ʇǝƃ:ɥɔʇıʍsɹǝʇsɐɯ‾sʃɐnsıʌ˙ɹǝʃpuɐɥ‾ın ʇou ɹo ()ʇǝƃ:ɥɔʇıʍs‾ƃɐʃǝʞɐɟ‾sʃɐnsıʌ˙ɹǝʃpuɐɥ‾ın ʇou ɟı    
() uoıʇɔunɟ = ʍɐɹp˙ɹoʇɐɔıpuı‾ƃɐʃǝʞɐɟ
0'0'0'0'0'0 = 4pǝʞoɥɔ˙ƃɐʃǝʞɐɟ '3pǝʞoɥɔ˙ƃɐʃǝʞɐɟ '2pǝʞoɥɔ˙ƃɐʃǝʞɐɟ '1pǝʞoɥɔ˙ƃɐʃǝʞɐɟ '0pǝʞoɥɔ˙ƃɐʃǝʞɐɟ 'ǝʞoɥɔpʃo˙ƃɐʃǝʞɐɟ

puǝ
puǝ	
(5˙0 'ɥɔʇıd‾ʎpoq˙sǝsod‾ǝ)ǝsod‾ɹǝpuǝɹ‾ʇǝs:ɯɐɹɐdǝsod		
uǝɥʇ ǝɯıʇɹnɔ &lt; ǝɯıʇ‾puǝ˙ɹǝʞɐǝɹq‾uoıʇɐɯıuɐ puɐ 1 &lt; ʞɔıʇ‾punoɹƃ˙ɹǝʞɐǝɹq‾uoıʇɐɯıuɐ puɐ (3)ʇǝƃ:ɹǝʞɐǝɹq‾ɯıuɐ˙ɹǝʃpuɐɥ‾ın ɟı    

puǝ	
(1 'ʃʃɐɟ‾dɯnɾ˙sǝsod‾ǝ)ǝsod‾ɹǝpuǝɹ‾ʇǝs:ɯɐɹɐdǝsod		
uǝɥʇ ɹıɐ‾uı‾sı puɐ (2)ʇǝƃ:ɹǝʞɐǝɹq‾ɯıuɐ˙ɹǝʃpuɐɥ‾ın ɟı	

puǝ    
(1 'unɹ˙sǝsod‾ǝ)ǝsod‾ɹǝpuǝɹ‾ʇǝs:ɯɐɹɐdǝsod        
uǝɥʇ (1)ʇǝƃ:ɹǝʞɐǝɹq‾ɯıuɐ˙ɹǝʃpuɐɥ‾ın ɟı    

puǝ    
(1 'uɐǝʃ˙sɹǝʎɐʃɯıuɐ‾ǝ)ɹǝʎɐʃɯıuɐ‾ɹǝpuǝɹ‾ʇǝs:ɯɐɹɐdǝsod        
uǝɥʇ 1 &lt; ʃʃıʇs‾d ɟı    

puǝ	
1 + ǝɯıʇɹnɔ = ǝɯıʇ‾puǝ˙ɹǝʞɐǝɹq‾uoıʇɐɯıuɐ		
0 = ʞɔıʇ‾punoɹƃ˙ɹǝʞɐǝɹq‾uoıʇɐɯıuɐ		
ǝsʃǝ	
1 + ʞɔıʇ‾punoɹƃ˙ɹǝʞɐǝɹq‾uoıʇɐɯıuɐ = ʞɔıʇ‾punoɹƃ˙ɹǝʞɐǝɹq‾uoıʇɐɯıuɐ		
uǝɥʇ ǝnɹʇ == puɐʃ‾uo ɟı	

 ()ǝɯıʇ‾ɹnɔ˙sɹɐʌ‾ʃɐqoʃƃ = ǝɯıʇɹnɔ ʃɐɔoʃ	

(2 ^ [1]ʎʇıɔoʃǝʌɔǝʌ‾ɯ + 2 ^ [0]ʎʇıɔoʃǝʌɔǝʌ‾ɯ)ʇɹbs˙ɥʇɐɯ = ʃʃıʇs‾d ʃɐɔoʃ    
("ʎʇıɔoʃǝʌɔǝʌ‾ɯ")doɹd‾ʇǝƃ:ɹǝʎɐʃdʃɐɔoʃ = ʎʇıɔoʃǝʌɔǝʌ‾ɯ ʃɐɔoʃ    

0 == (punoɹƃuo‾ʃɟ 'sƃɐʃɟ)puɐq‾ʇıq = ɹıɐ‾uı‾sı ʃɐɔoʃ    
0 =~ (punoɹƃuo‾ʃɟ 'sƃɐʃɟ)puɐq‾ʇıq = puɐʃ‾uo ʃɐɔoʃ    
("sƃɐʃɟɟ‾ɯ")doɹd‾ʇǝƃ:ɹǝʎɐʃdʃɐɔoʃ = sƃɐʃɟ ʃɐɔoʃ    

puǝ    
uɹnʇǝɹ        
uǝɥʇ ɹǝʎɐʃdʃɐɔoʃ ʇou ɟı    

()ɹǝʎɐʃd‾ʃɐɔoʃ‾ʇǝƃ˙ʇsıʃ‾ʎʇıʇuǝ = ɹǝʎɐʃdʃɐɔoʃ ʃɐɔoʃ    

puǝ    
uɹnʇǝɹ        
uǝɥʇ ()ʇǝƃ:ɥɔʇıʍsɹǝʇsɐɯ‾ʃɐqoʃƃ˙ɹǝʃpuɐɥ‾ın ʇou ɟı    
(ɯɐɹɐdǝsod) uoıʇɔunɟ = ǝʃpuɐɥ˙ɹǝʞɐǝɹq‾uoıʇɐɯıuɐ
0 = ǝɯıʇ‾puǝ˙ɹǝʞɐǝɹq‾uoıʇɐɯıuɐ
1 = ʞɔıʇ‾punoɹƃ˙ɹǝʞɐǝɹq‾uoıʇɐɯıuɐ

puǝ
puǝ    
puǝ        
()ǝƃɹɐɥɔǝɹ‾ʍoʃʃɐ˙sʇıoʃdxǝ            
ǝsʃǝ        
()ǝƃɹɐɥɔǝɹ‾ʞɔoʃq˙sʇıoʃdxǝ            
uǝɥʇ (ʌ)uodɐǝʍ‾ǝʌɐɥ‾ǝɹɐ puɐ (ʌ)sǝʃqısıʌ‾ɯǝɥʇ‾ǝɹɐ ɟı        
op (sǝıɯǝuǝ)sɹıɐdı uı ʌ 'ı ɹoɟ    

(ǝnɹʇ)sɹǝʎɐʃd‾ʇǝƃ˙ʇsıʃ‾ʎʇıʇuǝ = sǝıɯǝuǝ ʃɐɔoʃ    

puǝ    
uɹnʇǝɹ        
()ǝƃɹɐɥɔǝɹ‾ʍoʃʃɐ˙sʇıoʃdxǝ        
uǝɥʇ ()ʇǝƃ:[2]dɐʇ‾ǝʃqnop˙sɟǝɹ‾ʃɐıpɹoɯıɹd ʇou ɟı    

puǝ    
uɹnʇǝɹ        
()ǝƃɹɐɥɔǝɹ‾ʍoʃʃɐ˙sʇıoʃdxǝ        
uǝɥʇ ()ʇǝƃ:ǝƃɹɐɥɔ‾ǝʃqɐsıp˙ɹǝʃpuɐɥ‾ın ʇou ɹo ()ʇǝƃ:ɥɔʇıʍsɹǝʇsɐɯ‾ʃɐqoʃƃ˙ɹǝʃpuɐɥ‾ın ʇou ɟı    
(pɯɔ) uoıʇɔunɟ = ǝƃɹɐɥɔ˙ɹǝʃʃoɹʇuoɔ‾dɐʇǝʃqnop

puǝ
puǝ ǝsʃɐɟ uɹnʇǝɹ ǝsʃǝ ǝnɹʇ uɹnʇǝɹ uǝɥʇ (sod‾ɯɹɐ‾ʇɥƃıɹ)ǝʃqısıʌ‾ʇuıod‾sı:d‾ʃɐɔoʃ ɹo (sod‾ɯɹɐ‾ʇɟǝʃ)ǝʃqısıʌ‾ʇuıod‾sı:d‾ʃɐɔoʃ ɹo (sod‾ɔıɹǝuǝƃ)ǝʃqısıʌ‾ʇuıod‾sı:d‾ʃɐɔoʃ ɟı    
(ɯɹɐ‾ʇɥƃıɹ˙sdnoɹƃʇıɥ‾ǝ)sod‾xoqʇıɥ‾ʇǝƃ:ʇuǝ = sod‾ɯɹɐ‾ʇɥƃıɹ ʃɐɔoʃ    
(ɯɹɐ‾ʇɟǝʃ˙sdnoɹƃʇıɥ‾ǝ)sod‾xoqʇıɥ‾ʇǝƃ:ʇuǝ = sod‾ɯɹɐ‾ʇɟǝʃ ʃɐɔoʃ    
(ɔıɹǝuǝƃ˙sdnoɹƃʇıɥ‾ǝ)sod‾xoqʇıɥ‾ʇǝƃ:ʇuǝ = sod‾ɔıɹǝuǝƃ ʃɐɔoʃ    
()ɹǝʎɐʃd‾ʃɐɔoʃ‾ʇǝƃ:ʇsıʃ‾ʎʇıʇuǝ = d‾ʃɐɔoʃ ʃɐɔoʃ    
(ʇuǝ)sǝʃqısıʌ‾ɯǝɥʇ‾ǝɹɐ uoıʇɔunɟ ʃɐɔoʃ
puǝ
"ɹǝsɐʇuodɐǝʍɔ" =~ dǝʍ‾ɹnɔ‾ʇ puɐ "ǝpɐuǝɹƃǝɥɔ" =~ dǝʍ‾ɹnɔ‾ʇ puɐ "ǝpɐuǝɹƃǝʞoɯsɔ" =~ dǝʍ‾ɹnɔ‾ʇ puɐ "ǝpɐuǝɹƃʌoʇoʃoɯɔ" =~ dǝʍ‾ɹnɔ‾ʇ puɐ "4ɔɔ" =~ dǝʍ‾ɹnɔ‾ʇ puɐ "ǝɟıuʞɔ" =~ dǝʍ‾ɹnɔ‾ʇ uɹnʇǝɹ    
()ǝɯɐu‾ssɐʃɔ‾ʇǝƃ:()uodɐǝʍ‾ǝʌıʇɔɐ‾ʇǝƃ:ʇuǝ = dǝʍ‾ɹnɔ‾ʇ ʃɐɔoʃ    
puǝ uɹnʇǝɹ uǝɥʇ ()uodɐǝʍ‾ǝʌıʇɔɐ‾ʇǝƃ:ʇuǝ ʇou ɹo ()ǝʌıʃɐ‾sı:ʇuǝ ʇou ɟı    
(ʇuǝ)uodɐǝʍ‾ǝʌɐɥ‾ǝɹɐ uoıʇɔunɟ ʃɐɔoʃ

puǝ
(()ʇǝƃ:ǝnʃɐʌ‾pǝǝds‾dɐʇǝʃqnop˙ɹǝʃpuɐɥ‾ın)ʇuı‾ʇǝs:sʞɔıʇssǝɔoɹdpɯɔɹsnxɐɯ‾ʌs˙sɹɐʌɔ˙sǝuıɟǝp    

puǝ    
uɹnʇǝɹ        
uǝɥʇ ()ʇǝƃ:pǝǝds‾dɐʇǝʃqnop˙ɹǝʃpuɐɥ‾ın ʇou ɹo ()ʇǝƃ:ɥɔʇıʍsɹǝʇsɐɯ‾ʃɐqoʃƃ˙ɹǝʃpuɐɥ‾ın ʇou ɟı    
(pɯɔ) uoıʇɔunɟ = ǝʃpuɐɥ˙ɹǝʃʃoɹʇuoɔ‾dɐʇǝʃqnop

puǝ
(()ʇǝƃ:ǝɔuɐɥɔʇıɥ‾ɹıɐ˙ɹǝʃpuɐɥ‾ın)ǝɔuɐɥɔʇıɥ‾ʇǝs:xʇɔ    

puǝ    
uɹnʇǝɹ        
uǝɥʇ ɹıɐ‾uı‾sı ʇou ɟı    

0 == (punoɹƃuo‾ʃɟ 'sƃɐʃɟ)puɐq‾ʇıq = ɹıɐ‾uı‾sı ʃɐɔoʃ    
("sƃɐʃɟɟ‾ɯ")doɹd‾ʇǝƃ:ɹǝʎɐʃdʃɐɔoʃ = sƃɐʃɟ ʃɐɔoʃ    

puǝ    
uɹnʇǝɹ        
uǝɥʇ ɹǝʎɐʃdʃɐɔoʃ ʇou ɟı    

()ɹǝʎɐʃd‾ʃɐɔoʃ‾ʇǝƃ˙ʇsıʃ‾ʎʇıʇuǝ = ɹǝʎɐʃdʃɐɔoʃ ʃɐɔoʃ    

puǝ    
uɹnʇǝɹ        
uǝɥʇ ()ʇǝƃ:ǝɔuɐɥɔʇıɥ‾ɹıɐ‾ɯoʇsnɔ˙ɹǝʃpuɐɥ‾ın ʇou ɹo ()ʇǝƃ:ɥɔʇıʍsɹǝʇsɐɯ‾ʃɐqoʃƃ˙ɹǝʃpuɐɥ‾ın ʇou ɟı    
(ɐʇɐp‾pǝʇɔıpǝɹdun 'pɯɔ 'xʇɔ)uoıʇɔunɟ = ɹıɐ˙ǝɔuɐɥɔʇıɥ‾ʃɐuoıʇıpuoɔ

puǝ
puǝ    
ǝnɹʇ = ʇp˙sɹǝʃpuɐɥ        
()ǝƃɹɐɥɔun‾ǝɔɹoɟ˙sʇıoʃdxǝ        
uǝɥʇ ()ʇǝƃ:[2]dɐʇ‾ǝʃqnop˙sɟǝɹ‾ʃɐıpɹoɯıɹd ɟı    
    
()ʇunoɔ‾ʞɔıʇ˙sɹɐʌ‾ʃɐqoʃƃ = ǝƃɹɐɥɔǝɹ˙sɹǝʃpuɐɥ    

("¡pǝɟıuʞ")ƃnqǝp    

puǝ    
uɹnʇǝɹ        
uǝɥʇ ɹǝʎɐʃdʃɐɔoʃ =~ pıɹǝsn ɟı    

(pıɹǝsn˙ʇuǝʌǝ)pıɹǝsn‾ɯoɹɟ‾ɹǝʎɐʃd‾ʇǝƃ˙ʇsıʃ‾ʎʇıʇuǝ = pıɹǝsn ʃɐɔoʃ    

puǝ    
uɹnʇǝɹ        
uǝɥʇ "ǝɟıuʞɔ" =~ ()ǝɯɐu‾ssɐʃɔ‾ʇǝƃ:()uodɐǝʍ‾ǝʌıʇɔɐ‾ʇǝƃ:ɹǝʎɐʃdʃɐɔoʃ ɟı    

puǝ    
uɹnʇǝɹ        
uǝɥʇ ()uodɐǝʍ‾ǝʌıʇɔɐ‾ʇǝƃ:ɹǝʎɐʃdʃɐɔoʃ ʇou ɹo ɹǝʎɐʃdʃɐɔoʃ ʇou ɟı    

()ɹǝʎɐʃd‾ʃɐɔoʃ‾ʇǝƃ˙ʇsıʃ‾ʎʇıʇuǝ = ɹǝʎɐʃdʃɐɔoʃ ʃɐɔoʃ    

puǝ    
uɹnʇǝɹ        
uǝɥʇ ()ʇǝƃ:ǝɟıuʞ‾dɐʇǝʃqnop˙ɹǝʃpuɐɥ‾ın ʇou ɹo ()ʇǝƃ:ɥɔʇıʍsɹǝʇsɐɯ‾ʃɐqoʃƃ˙ɹǝʃpuɐɥ‾ın ʇou ɟı    
(ʇuǝʌǝ) uoıʇɔunɟ = ǝɟıuʞʇp˙sɹǝʃpuɐɥ
puǝ
puǝ    
ǝsʃɐɟ = ʇp˙sɹǝʃpuɐɥ        
()ǝƃɹɐɥɔun‾ǝɔɹoɟ˙sʇıoʃdxǝ        
uǝɥʇ ()ʇunoɔ‾ʞɔıʇ˙sɹɐʌ‾ʃɐqoʃƃ == 51 + ǝƃɹɐɥɔǝɹ˙sɹǝʃpuɐɥ puɐ ʇp˙sɹǝʃpuɐɥ ɟı    

puǝ    
uɹnʇǝɹ        
uǝɥʇ "ǝɟıuʞɔ" =~ ()ǝɯɐu‾ssɐʃɔ‾ʇǝƃ:()uodɐǝʍ‾ǝʌıʇɔɐ‾ʇǝƃ:ɹǝʎɐʃdʃɐɔoʃ ɟı    

puǝ    
uɹnʇǝɹ        
uǝɥʇ ()uodɐǝʍ‾ǝʌıʇɔɐ‾ʇǝƃ:ɹǝʎɐʃdʃɐɔoʃ ʇou ɹo ɹǝʎɐʃdʃɐɔoʃ ʇou ɟı    

()ɹǝʎɐʃd‾ʃɐɔoʃ‾ʇǝƃ˙ʇsıʃ‾ʎʇıʇuǝ = ɹǝʎɐʃdʃɐɔoʃ ʃɐɔoʃ    

puǝ    
uɹnʇǝɹ        
uǝɥʇ ()ʇǝƃ:ǝɟıuʞ‾dɐʇǝʃqnop˙ɹǝʃpuɐɥ‾ın ʇou ɹo ()ʇǝƃ:ɥɔʇıʍsɹǝʇsɐɯ‾ʃɐqoʃƃ˙ɹǝʃpuɐɥ‾ın ʇou ɟı    
() uoıʇɔunɟ = ǝɟıuʞ˙sɹǝʃpuɐɥ
ǝsʃɐɟ = ʇp˙sɹǝʃpuɐɥ
0 = ǝƃɹɐɥɔǝɹ˙sɹǝʃpuɐɥ

puǝ
(ɔsıɯsı)ǝʃqısıʌ‾ʇǝs:ʞʃɐʇɥsɐɹʇ‾ɔsıɯ˙ɹǝʃpuɐɥ‾ın    
(5 == ()ʇǝƃ:uoıʇɔǝʃǝsqɐʇ˙ɹǝʃpuɐɥ‾ın)ǝʃqısıʌ‾ʇǝs:ɥɔʇıʍsɹǝʇsɐɯ‾ɔsıɯ˙ɹǝʃpuɐɥ‾ın    

()ʇǝƃ:ɥɔʇıʍsɹǝʇsɐɯ‾ɔsıɯ˙ɹǝʃpuɐɥ‾ın puɐ 5 == ()ʇǝƃ:uoıʇɔǝʃǝsqɐʇ˙ɹǝʃpuɐɥ‾ın = ɔsıɯsı ʃɐɔoʃ    

puǝ    
uɹnʇǝɹ        
uǝɥʇ ()uǝdo‾sı‾nuǝɯ ʇou ɟı    
() uoıʇɔunɟ = ʍɐɹpuo‾ɔsıɯ˙ɹǝʃpuɐɥ‾ın

puǝ
(ƃɐʃǝʞɐɟsı)ǝʃqısıʌ‾ʇǝs:ǝpoɯ‾ƃɐʃǝʞɐɟ˙ɹǝʃpuɐɥ‾ın    
(ƃɐʃǝʞɐɟsı)ǝʃqısıʌ‾ʇǝs:puǝsǝpɐu‾ƃɐʃǝʞɐɟ˙ɹǝʃpuɐɥ‾ın    
(ƃɐʃǝʞɐɟsı)ǝʃqısıʌ‾ʇǝs:puǝsʇuɐɯɹop‾ƃɐʃǝʞɐɟ˙ɹǝʃpuɐɥ‾ın    
(ƃɐʃǝʞɐɟsı)ǝʃqısıʌ‾ʇǝs:puǝspuɐʇs‾ƃɐʃǝʞɐɟ˙ɹǝʃpuɐɥ‾ın    
(4 == ()ʇǝƃ:uoıʇɔǝʃǝsqɐʇ˙ɹǝʃpuɐɥ‾ın)ǝʃqısıʌ‾ʇǝs:ɥɔʇıʍsɹǝʇsɐɯ‾ƃɐʃǝʞɐɟ˙ɹǝʃpuɐɥ‾ın    

()ʇǝƃ:ɥɔʇıʍsɹǝʇsɐɯ‾ƃɐʃǝʞɐɟ˙ɹǝʃpuɐɥ‾ın puɐ 4 == ()ʇǝƃ:uoıʇɔǝʃǝsqɐʇ˙ɹǝʃpuɐɥ‾ın = ƃɐʃǝʞɐɟsı ʃɐɔoʃ    

puǝ    
uɹnʇǝɹ        
uǝɥʇ ()uǝdo‾sı‾nuǝɯ ʇou ɟı    
() uoıʇɔunɟ = ʍɐɹpuo‾ƃɐʃǝʞɐɟ˙ɹǝʃpuɐɥ‾ın

puǝ
puǝ    
(()ʇǝƃ:ǝpıɹɹǝʌo‾sı˙[ǝɯɐu]sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ puɐ p‾pǝʃqɐuǝ)ǝʃqısıʌ‾ʇǝs:suoıʇdo‾ǝʞɐɟ˙[ǝɯɐu]sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ        
(()ʇǝƃ:ǝpıɹɹǝʌo‾sı˙[ǝɯɐu]sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ puɐ p‾pǝʃqɐuǝ)ǝʃqısıʌ‾ʇǝs:ʇɥƃıɹ‾ʇıɯıʃ‾ǝʞɐɟ˙[ǝɯɐu]sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ        
(()ʇǝƃ:ǝpıɹɹǝʌo‾sı˙[ǝɯɐu]sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ puɐ p‾pǝʃqɐuǝ)ǝʃqısıʌ‾ʇǝs:ʇɟǝʃ‾ʇıɯıʃ‾ǝʞɐɟ˙[ǝɯɐu]sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ        
(()ʇǝƃ:ǝpıɹɹǝʌo‾sı˙[ǝɯɐu]sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ puɐ p‾pǝʃqɐuǝ)ǝʃqısıʌ‾ʇǝs:oqɯoɔ‾ʇıɯıʃ‾ǝʞɐɟ˙[ǝɯɐu]sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ        
(()ʇǝƃ:ǝpıɹɹǝʌo‾sı˙[ǝɯɐu]sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ puɐ p‾pǝʃqɐuǝ)ǝʃqısıʌ‾ʇǝs:ǝǝɹƃǝp‾ɹǝıɟıpoɯ˙[ǝɯɐu]sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ        
(()ʇǝƃ:ǝpıɹɹǝʌo‾sı˙[ǝɯɐu]sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ puɐ p‾pǝʃqɐuǝ)ǝʃqısıʌ‾ʇǝs:ɹǝıɟıpoɯ‾ʍɐʎ˙[ǝɯɐu]sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ        
(()ʇǝƃ:ǝpıɹɹǝʌo‾sı˙[ǝɯɐu]sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ puɐ p‾pǝʃqɐuǝ)ǝʃqısıʌ‾ʇǝs:ʇɥƃıɹ‾ppɐ‾ʍɐʎ˙[ǝɯɐu]sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ        
(()ʇǝƃ:ǝpıɹɹǝʌo‾sı˙[ǝɯɐu]sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ puɐ p‾pǝʃqɐuǝ)ǝʃqısıʌ‾ʇǝs:ʇɟǝʃ‾ppɐ‾ʍɐʎ˙[ǝɯɐu]sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ        
(ǝɯɐu == [()ʇǝƃ:uoıʇıpuoɔ‾ʇuǝɹɹnɔ˙sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ]sǝʇɐʇsɹǝʎɐʃd˙sǝuıɟǝp puɐ ()ʇǝƃ:uoıʇıpuoɔ‾sɯıɐıʇuɐ˙sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ puɐ sɯıɐıʇuɐsı puɐ "pǝɹɐɥs" =~ ǝɯɐu puɐ ǝnɹʇ)ǝʃqısıʌ‾ʇǝs:ǝpıɹɹǝʌo‾sı˙[ǝɯɐu]sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ        

()ʇǝƃ:uoıʇıpuoɔ‾sɯıɐıʇuɐ˙sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ puɐ ǝɯɐu == [()ʇǝƃ:uoıʇıpuoɔ‾ʇuǝɹɹnɔ˙sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ]sǝʇɐʇsɹǝʎɐʃd˙sǝuıɟǝp puɐ sɯıɐıʇuɐsı = p‾pǝʃqɐuǝ ʃɐɔoʃ        

[ı]sǝʇɐʇsɹǝʎɐʃd˙sǝuıɟǝp = ǝɯɐu ʃɐɔoʃ        
op (sǝʇɐʇsɹǝʎɐʃd˙sǝuıɟǝp) sɹıɐdı uı ı ɹoɟ    

(ǝnɹʇ)ʇǝs:ǝpıɹɹǝʌo‾sı˙["pǝɹɐɥs"]sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ    

(ɐɐʇʃnɐɟǝppʃnoɥs)ǝʃqısıʌ‾ʇǝs:suoıʇdo‾ǝʞɐɟ˙sɯıɐıʇuɐ‾ʇʃnɐɟǝp    
(ɐɐʇʃnɐɟǝppʃnoɥs)ǝʃqısıʌ‾ʇǝs:ʇıɯıʃ‾ʞʃɐʍʍoʃs˙sɯıɐıʇuɐ‾ʇʃnɐɟǝp    
(ɐɐʇʃnɐɟǝppʃnoɥs)ǝʃqısıʌ‾ʇǝs:ɯoʇsnɔ‾ʞʃɐʍʍoʃs˙sɯıɐıʇuɐ‾ʇʃnɐɟǝp    
(ɐɐʇʃnɐɟǝppʃnoɥs)ǝʃqısıʌ‾ʇǝs:ʇɥƃıɹ‾ʇıɯıʃ‾ǝʞɐɟ˙sɯıɐıʇuɐ‾ʇʃnɐɟǝp    
(ɐɐʇʃnɐɟǝppʃnoɥs)ǝʃqısıʌ‾ʇǝs:ʇɟǝʃ‾ʇıɯıʃ‾ǝʞɐɟ˙sɯıɐıʇuɐ‾ʇʃnɐɟǝp    
(ɐɐʇʃnɐɟǝppʃnoɥs)ǝʃqısıʌ‾ʇǝs:oqɯoɔ‾ʇıɯıʃ‾ǝʞɐɟ˙sɯıɐıʇuɐ‾ʇʃnɐɟǝp    
(ɐɐʇʃnɐɟǝppʃnoɥs)ǝʃqısıʌ‾ʇǝs:ǝǝɹƃǝp‾ɹǝıɟıpoɯ˙sɯıɐıʇuɐ‾ʇʃnɐɟǝp    
(ɐɐʇʃnɐɟǝppʃnoɥs)ǝʃqısıʌ‾ʇǝs:ɹǝıɟıpoɯ‾ʍɐʎ˙sɯıɐıʇuɐ‾ʇʃnɐɟǝp    
(ɐɐʇʃnɐɟǝppʃnoɥs)ǝʃqısıʌ‾ʇǝs:ʇɥƃıɹ‾ppɐ‾ʍɐʎ˙sɯıɐıʇuɐ‾ʇʃnɐɟǝp    
(ɐɐʇʃnɐɟǝppʃnoɥs)ǝʃqısıʌ‾ʇǝs:ʇɟǝʃ‾ppɐ‾ʍɐʎ˙sɯıɐıʇuɐ‾ʇʃnɐɟǝp    
()ʇǝƃ:uoıʇıpuoɔ‾sɯıɐıʇuɐ˙sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ ʇou puɐ sɯıɐıʇuɐsı = ɐɐʇʃnɐɟǝppʃnoɥs ʃɐɔoʃ    

(()ʇǝƃ:uoıʇıpuoɔ‾sɯıɐıʇuɐ˙sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ puɐ sɯıɐıʇuɐsı)ǝʃqısıʌ‾ʇǝs:uoıʇıpuoɔ‾ʇuǝɹɹnɔ˙sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ    
(sɯıɐıʇuɐsı)ǝʃqısıʌ‾ʇǝs:uoıʇıpuoɔ‾sɯıɐıʇuɐ˙sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ    

(sɯıɐıʇuɐsı)ǝʃqısıʌ‾ʇǝs:ɐɐʃʃoɹ‾sɯıɐıʇuɐ˙ɹǝʃpuɐɥ‾ın    
(sɯıɐıʇuɐsı)ǝʃqısıʌ‾ʇǝs:ɹıɐ‾ɔʃ‾sɯıɐıʇuɐ˙ɹǝʃpuɐɥ‾ın    
(sɯıɐıʇuɐsı)ǝʃqısıʌ‾ʇǝs:ɹǝʇɹǝʌuı‾sɯıɐıʇuɐ˙ɹǝʃpuɐɥ‾ın    

(3 == ()ʇǝƃ:uoıʇɔǝʃǝsqɐʇ˙ɹǝʃpuɐɥ‾ın)ǝʃqısıʌ‾ʇǝs:ɥɔʇıʍsɹǝʇsɐɯ‾sɯıɐıʇuɐ˙ɹǝʃpuɐɥ‾ın    

()ʇǝƃ:ɥɔʇıʍsɹǝʇsɐɯ‾sɯıɐıʇuɐ˙ɹǝʃpuɐɥ‾ın puɐ 3 == ()ʇǝƃ:uoıʇɔǝʃǝsqɐʇ˙ɹǝʃpuɐɥ‾ın = sɯıɐıʇuɐsı ʃɐɔoʃ    

puǝ    
uɹnʇǝɹ        
uǝɥʇ ()uǝdo‾sı‾nuǝɯ ʇou ɟı    
() uoıʇɔunɟ = ʍɐɹpuo‾sɯıɐıʇuɐ˙ɹǝʃpuɐɥ‾ın

puǝ
(sʃɐnsıʌsı)ǝʃqısıʌ‾ʇǝs:ǝdʎʇ‾ɹoʇɐɔıpuıɹıɐɥssoɹɔ‾sʃɐnsıʌ˙ɹǝʃpuɐɥ‾ın    
(sʃɐnsıʌsı)ǝʃqısıʌ‾ʇǝs:ɥɔʇıʍs‾ƃɐʃǝʞɐɟ‾sʃɐnsıʌ˙ɹǝʃpuɐɥ‾ın    

(2 == ()ʇǝƃ:uoıʇɔǝʃǝsqɐʇ˙ɹǝʃpuɐɥ‾ın)ǝʃqısıʌ‾ʇǝs:ɥɔʇıʍsɹǝʇsɐɯ‾sʃɐnsıʌ˙ɹǝʃpuɐɥ‾ın    

()ʇǝƃ:ɥɔʇıʍsɹǝʇsɐɯ‾sʃɐnsıʌ˙ɹǝʃpuɐɥ‾ın puɐ 2 == ()ʇǝƃ:uoıʇɔǝʃǝsqɐʇ˙ɹǝʃpuɐɥ‾ın = sʃɐnsıʌsı ʃɐɔoʃ    

puǝ    
uɹnʇǝɹ        
uǝɥʇ ()uǝdo‾sı‾nuǝɯ ʇou ɟı    
() uoıʇɔunɟ = ʍɐɹpuo‾sʃɐnsıʌ˙ɹǝʃpuɐɥ‾ın

puǝ
(ʃɐqoʃƃsı)ǝʃqısıʌ‾ʇǝs:ɹǝʞɐǝɹq‾ɯıuɐ˙ɹǝʃpuɐɥ‾ın    
(ʃɐqoʃƃsı)ǝʃqısıʌ‾ʇǝs:ǝƃɹɐɥɔ‾ǝʃqɐsıp˙ɹǝʃpuɐɥ‾ın    
(()ʇǝƃ:pǝǝds‾dɐʇǝʃqnop˙ɹǝʃpuɐɥ‾ın puɐ ʃɐqoʃƃsı)ǝʃqısıʌ‾ʇǝs:ǝnʃɐʌ‾pǝǝds‾dɐʇǝʃqnop˙ɹǝʃpuɐɥ‾ın    
(ʃɐqoʃƃsı)ǝʃqısıʌ‾ʇǝs:pǝǝds‾dɐʇǝʃqnop˙ɹǝʃpuɐɥ‾ın    
(()ʇǝƃ:ǝɔuɐɥɔʇıɥ‾ɹıɐ‾ɯoʇsnɔ˙ɹǝʃpuɐɥ‾ın puɐ ʃɐqoʃƃsı)ǝʃqısıʌ‾ʇǝs:ǝɔuɐɥɔʇıɥ‾ɹıɐ˙ɹǝʃpuɐɥ‾ın    
(ʃɐqoʃƃsı)ǝʃqısıʌ‾ʇǝs:ǝɔuɐɥɔʇıɥ‾ɹıɐ‾ɯoʇsnɔ˙ɹǝʃpuɐɥ‾ın    
(ʃɐqoʃƃsı)ǝʃqısıʌ‾ʇǝs:ǝɟıuʞ‾dɐʇǝʃqnop˙ɹǝʃpuɐɥ‾ın    
(1 == ()ʇǝƃ:uoıʇɔǝʃǝsqɐʇ˙ɹǝʃpuɐɥ‾ın)ǝʃqısıʌ‾ʇǝs:ɥɔʇıʍsɹǝʇsɐɯ‾ʃɐqoʃƃ˙ɹǝʃpuɐɥ‾ın    

()ʇǝƃ:ɥɔʇıʍsɹǝʇsɐɯ‾ʃɐqoʃƃ˙ɹǝʃpuɐɥ‾ın puɐ 1 == ()ʇǝƃ:uoıʇɔǝʃǝsqɐʇ˙ɹǝʃpuɐɥ‾ın = ʃɐqoʃƃsı ʃɐɔoʃ    

puǝ    
uɹnʇǝɹ        
uǝɥʇ ()uǝdo‾sı‾nuǝɯ ʇou ɟı    
() uoıʇɔunɟ = ʍɐɹpuo‾ʃɐqoʃƃ˙ɹǝʃpuɐɥ‾ın

(ǝsʃɐɟ '"ʃʃıʞ uo ʞʃɐʇɥsɐɹʇ" '"ɔsıɯ")xoqʞɔǝɥɔ‾ppɐ‾nuǝɯ = ʞʃɐʇɥsɐɹʇ‾ɔsıɯ˙ɹǝʃpuɐɥ‾ın
(ǝsʃɐɟ '"ǝʃqɐuǝ" '"ɔsıɯ")xoqʞɔǝɥɔ‾ppɐ‾nuǝɯ = ɥɔʇıʍsɹǝʇsɐɯ‾ɔsıɯ˙ɹǝʃpuɐɥ‾ın

({"ʎʇıɔoʃǝʌ" '"ɯnɯıxɐɯ" '"dǝʇs" '"ǝʌʃɐʌ" '"ɥʌɥ"} '"ǝpoɯ ƃɐʃ-ǝʞɐɟ" '"ƃɐʃ ǝʞɐɟ")uoıʇɔǝʃǝs‾ppɐ‾nuǝɯ = ǝpoɯ‾ƃɐʃǝʞɐɟ˙ɹǝʃpuɐɥ‾ın
(ǝsʃɐɟ '"sǝpɐu uo ǝʃqɐsıp" '"ƃɐʃ ǝʞɐɟ")xoqʞɔǝɥɔ‾ppɐ‾nuǝɯ = puǝsǝpɐu‾ƃɐʃǝʞɐɟ˙ɹǝʃpuɐɥ‾ın
(ǝsʃɐɟ '"ʇuɐɯɹop sǝıɯǝuǝ uo ǝʃqɐsıp" '"ƃɐʃ ǝʞɐɟ")xoqʞɔǝɥɔ‾ppɐ‾nuǝɯ = puǝsʇuɐɯɹop‾ƃɐʃǝʞɐɟ˙ɹǝʃpuɐɥ‾ın
(ǝsʃɐɟ '"ƃuıpuɐʇs uo ǝʃqɐsıp" '"ƃɐʃ ǝʞɐɟ")xoqʞɔǝɥɔ‾ppɐ‾nuǝɯ = puǝspuɐʇs‾ƃɐʃǝʞɐɟ˙ɹǝʃpuɐɥ‾ın
(ǝsʃɐɟ '"ǝʃqɐuǝ" '"ƃɐʃ ǝʞɐɟ")xoqʞɔǝɥɔ‾ppɐ‾nuǝɯ = ɥɔʇıʍsɹǝʇsɐɯ‾ƃɐʃǝʞɐɟ˙ɹǝʃpuɐɥ‾ın

puǝ
()ʇǝƃ:[2]ƃuıpuɐʇsǝǝɹɟ˙sɟǝɹ‾ʃɐıpɹoɯıɹd ɹo 0 =~ ()ǝpıɹɹǝʌo‾ʃɐnuɐɯ‾ʇǝƃ‾ɯıɐıʇuɐ uɹnʇǝɹ    
() uoıʇɔunɟ = pǝʃqɐuǝ‾ʃɐnuɐɯ‾sı˙sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ

puǝ
{    
'({"ɹǝʇʇıɾ ǝzıɯopuɐɹ" '"ɹǝʇʇıɾ" '"dɐʃɹǝʌo pıoʌɐ"} '"suoıʇdo ǝʞɐɟ" 'ǝɯɐu)uoıʇɔǝʃǝs‾ıʇʃnɯ‾ppɐ‾nuǝɯ = suoıʇdo‾ǝʞɐɟ        
'(06 '0 '"ʇɥƃıɹ ʇıɯıʃ ǝʞɐɟ" 'ǝɯɐu)ɹǝpıʃs‾ppɐ‾nuǝɯ = ʇɥƃıɹ‾ʇıɯıʃ‾ǝʞɐɟ        
'(06 '0 '"ʇɟǝʃ ʇıɯıʃ ǝʞɐɟ" 'ǝɯɐu)ɹǝpıʃs‾ppɐ‾nuǝɯ = ʇɟǝʃ‾ʇıɯıʃ‾ǝʞɐɟ        
'({"ɹǝʇʇıɾ" '"ɔıʇɐʇs"} '"ǝpoɯ ʇıɯıʃ ǝʞɐɟ" 'ǝɯɐu)uoıʇɔǝʃǝs‾ppɐ‾nuǝɯ = oqɯoɔ‾ʇıɯıʃ‾ǝʞɐɟ        
'(081 '081- '"ǝǝɹƃǝp ɹǝıɟıpoɯ" 'ǝɯɐu)ɹǝpıʃs‾ppɐ‾nuǝɯ = ǝǝɹƃǝp‾ɹǝıɟıpoɯ        
'({"ɯopuɐɹ" '"ʇǝsɟɟo" '"ɹǝʇuǝɔ" '"pǝʃqɐsıp"} '"ɹǝıɟıpoɯ ʍɐʎ" 'ǝɯɐu)uoıʇɔǝʃǝs‾ppɐ‾nuǝɯ = ɹǝıɟıpoɯ‾ʍɐʎ        
'(081 '081- '"ʇɥƃıɹ ppɐ ʍɐʎ" 'ǝɯɐu)ɹǝpıʃs‾ppɐ‾nuǝɯ = ʇɥƃıɹ‾ppɐ‾ʍɐʎ        
'(081 '081- '"ʇɟǝʃ ppɐ ʍɐʎ" 'ǝɯɐu)ɹǝpıʃs‾ppɐ‾nuǝɯ = ʇɟǝʃ‾ppɐ‾ʍɐʎ        
'(ǝsʃɐɟ 'ǝɯɐu ˙˙" ǝpıɹɹǝʌo" '"sɯıɐ ıʇuɐ")xoqʞɔǝɥɔ‾ppɐ‾nuǝɯ = ǝpıɹɹǝʌo‾sı        
} = [ǝɯɐu]sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ    
[ı]sǝʇɐʇsɹǝʎɐʃd˙sǝuıɟǝp = ǝɯɐu ʃɐɔoʃ    
op (sǝʇɐʇsɹǝʎɐʃd˙sǝuıɟǝp) sɹıɐdı uı ı ɹoɟ

({"ɹǝʇʇıɾ ǝzıɯopuɐɹ" '"ɹǝʇʇıɾ" '"dɐʃɹǝʌo pıoʌɐ"} '"suoıʇdo ǝʞɐɟ" '"ʇǝsǝɹd ɯıɐ ıʇuɐ")uoıʇɔǝʃǝs‾ıʇʃnɯ‾ppɐ‾nuǝɯ = suoıʇdo‾ǝʞɐɟ˙sɯıɐıʇuɐ‾ʇʃnɐɟǝp
(54 '5 '"ʇıɯıʃ ǝʞɐɟ ʞʃɐʍʍoʃs" '"ʇǝsǝɹd ɯıɐ ıʇuɐ")ɹǝpıʃs‾ppɐ‾nuǝɯ = ʇıɯıʃ‾ʞʃɐʍʍoʃs˙sɯıɐıʇuɐ‾ʇʃnɐɟǝp
(ǝsʃɐɟ '"ʇıɯıʃ ǝʞɐɟ ʞʃɐʍʍoʃs ɯoʇsnɔ" '"ʇǝsǝɹd ɯıɐ ıʇuɐ")xoqʞɔǝɥɔ‾ppɐ‾nuǝɯ = ɯoʇsnɔ‾ʞʃɐʍʍoʃs˙sɯıɐıʇuɐ‾ʇʃnɐɟǝp
(06 '0 '"ʇɥƃıɹ ʇıɯıʃ ǝʞɐɟ" '"ʇǝsǝɹd ɯıɐ ıʇuɐ")ɹǝpıʃs‾ppɐ‾nuǝɯ = ʇɥƃıɹ‾ʇıɯıʃ‾ǝʞɐɟ˙sɯıɐıʇuɐ‾ʇʃnɐɟǝp
(06 '0 '"ʇɟǝʃ ʇıɯıʃ ǝʞɐɟ" '"ʇǝsǝɹd ɯıɐ ıʇuɐ")ɹǝpıʃs‾ppɐ‾nuǝɯ = ʇɟǝʃ‾ʇıɯıʃ‾ǝʞɐɟ˙sɯıɐıʇuɐ‾ʇʃnɐɟǝp
({"ɹǝʇʇıɾ" '"ɔıʇɐʇs"} '"ǝpoɯ ʇıɯıʃ ǝʞɐɟ" '"ʇǝsǝɹd ɯıɐ ıʇuɐ")uoıʇɔǝʃǝs‾ppɐ‾nuǝɯ = oqɯoɔ‾ʇıɯıʃ‾ǝʞɐɟ˙sɯıɐıʇuɐ‾ʇʃnɐɟǝp
(081 '081- '"ǝǝɹƃǝp ɹǝıɟıpoɯ" '"ʇǝsǝɹd ɯıɐ ıʇuɐ")ɹǝpıʃs‾ppɐ‾nuǝɯ = ǝǝɹƃǝp‾ɹǝıɟıpoɯ˙sɯıɐıʇuɐ‾ʇʃnɐɟǝp
({"ɯopuɐɹ" '"ʇǝsɟɟo" '"ɹǝʇuǝɔ" '"pǝʃqɐsıp"} '"ɹǝıɟıpoɯ ʍɐʎ" '"ʇǝsǝɹd ɯıɐ ıʇuɐ")uoıʇɔǝʃǝs‾ppɐ‾nuǝɯ = ɹǝıɟıpoɯ‾ʍɐʎ˙sɯıɐıʇuɐ‾ʇʃnɐɟǝp
(081 '081- '"ʇɥƃıɹ ppɐ ʍɐʎ" '"ʇǝsǝɹd ɯıɐ ıʇuɐ")ɹǝpıʃs‾ppɐ‾nuǝɯ = ʇɥƃıɹ‾ppɐ‾ʍɐʎ˙sɯıɐıʇuɐ‾ʇʃnɐɟǝp
(081 '081- '"ʇɟǝʃ ppɐ ʍɐʎ" '"ʇǝsǝɹd ɯıɐ ıʇuɐ")ɹǝpıʃs‾ppɐ‾nuǝɯ = ʇɟǝʃ‾ppɐ‾ʍɐʎ˙sɯıɐıʇuɐ‾ʇʃnɐɟǝp


(sǝʇɐʇsɹǝʎɐʃd˙sǝuıɟǝp '"uoıʇıpuoɔ ʇuǝɹɹnɔ" '"sɯıɐ ıʇuɐ")uoıʇɔǝʃǝs‾ppɐ‾nuǝɯ = uoıʇıpuoɔ‾ʇuǝɹɹnɔ˙sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ
(ǝsʃɐɟ '"suoıʇıpuoɔ" '"sɯıɐ ıʇuɐ")xoqʞɔǝɥɔ‾ppɐ‾nuǝɯ = uoıʇıpuoɔ‾sɯıɐıʇuɐ˙sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ

("ʎǝʞ ɐɐ ʃʃoɹ")puıqʎǝʞ‾ppɐ:ɐɐʃʃoɹ‾sɯıɐıʇuɐ˙ɹǝʃpuɐɥ‾ın = puıq‾ɐɐʃʃoɹ‾sɯıɐıʇuɐ˙ɹǝʃpuɐɥ‾ın
({"ʇɹǝʌuı" '"ǝpıs ǝɯɐs" '"ʇʃnɐɟǝp"} '"ɐɐ ʃʃoɹ" '"sɯıɐ ıʇuɐ")uoıʇɔǝʃǝs‾ppɐ‾nuǝɯ = ɐɐʃʃoɹ‾sɯıɐıʇuɐ˙ɹǝʃpuɐɥ‾ın
(ǝsʃɐɟ '"ɹıɐ uı ʇɹodǝʃǝʇ ʇıoʃdxǝ" '"sɯıɐ ıʇuɐ")xoqʞɔǝɥɔ‾ppɐ‾nuǝɯ = ɹıɐ‾ɔʃ‾sɯıɐıʇuɐ˙ɹǝʃpuɐɥ‾ın

("ʎǝʞ ɹǝʇɹǝʌuı")puıqʎǝʞ‾ppɐ:ɹǝʇɹǝʌuı‾sɯıɐıʇuɐ˙ɹǝʃpuɐɥ‾ın = puıq‾ɹǝʇɹǝʌuı‾sɯıɐıʇuɐ˙ɹǝʃpuɐɥ‾ın
("ɹǝʇɹǝʌuı" '"sɯıɐ ıʇuɐ")xoqʞɔǝɥɔ‾ppɐ‾nuǝɯ = ɹǝʇɹǝʌuı‾sɯıɐıʇuɐ˙ɹǝʃpuɐɥ‾ın
(ǝsʃɐɟ '"ǝʃqɐuǝ" '"sɯıɐ ıʇuɐ")xoqʞɔǝɥɔ‾ppɐ‾nuǝɯ = ɥɔʇıʍsɹǝʇsɐɯ‾sɯıɐıʇuɐ˙ɹǝʃpuɐɥ‾ın

("ɔuʎsǝp")ɹǝʞɔıd‾ɹoʃoɔ‾ppɐ:ǝdʎʇ‾ɹoʇɐɔıpuıɹıɐɥssoɹɔ‾sʃɐnsıʌ˙ɹǝʃpuɐɥ‾ın = ɹoʃoɔɔuʎsǝp‾ɹoʇɐɔıpuıɹıɐɥssoɹɔ‾sʃɐnsıʌ˙ɹǝʃpuɐɥ‾ın
("ǝpıs")ɹǝʞɔıd‾ɹoʃoɔ‾ppɐ:ǝdʎʇ‾ɹoʇɐɔıpuıɹıɐɥssoɹɔ‾sʃɐnsıʌ˙ɹǝʃpuɐɥ‾ın = ɹoʃoɔǝpıs‾ɹoʇɐɔıpuıɹıɐɥssoɹɔ‾sʃɐnsıʌ˙ɹǝʃpuɐɥ‾ın
("uıɐɯ")ɹǝʞɔıd‾ɹoʃoɔ‾ppɐ:ǝdʎʇ‾ɹoʇɐɔıpuıɹıɐɥssoɹɔ‾sʃɐnsıʌ˙ɹǝʃpuɐɥ‾ın = ɹoʃoɔuıɐɯ‾ɹoʇɐɔıpuıɹıɐɥssoɹɔ‾sʃɐnsıʌ˙ɹǝʃpuɐɥ‾ın
({"dɹɐɥs" '"pǝʃqɐsıp"} '"sɹoʇɐɔıpuı ɹıɐɥssoɹɔ" '"sʃɐnsıʌ")uoıʇɔǝʃǝs‾ppɐ‾nuǝɯ = ǝdʎʇ‾ɹoʇɐɔıpuıɹıɐɥssoɹɔ‾sʃɐnsıʌ˙ɹǝʃpuɐɥ‾ın
(ǝsʃɐɟ '"ʎɹoʇsıɥ ƃɐʃǝʞɐɟ" '"sʃɐnsıʌ")xoqʞɔǝɥɔ‾ppɐ‾nuǝɯ = ɥɔʇıʍs‾ƃɐʃǝʞɐɟ‾sʃɐnsıʌ˙ɹǝʃpuɐɥ‾ın
(ǝsʃɐɟ '"ǝʃqɐuǝ" '"sʃɐnsıʌ")xoqʞɔǝɥɔ‾ppɐ‾nuǝɯ = ɥɔʇıʍsɹǝʇsɐɯ‾sʃɐnsıʌ˙ɹǝʃpuɐɥ‾ın

({"puɐʃ uo ɥɔʇıd oɹǝz" '"ɹıɐ" '"punoɹƃ"} '"ɹǝʞɐǝɹq uoıʇɐɯıuɐ" '"ʃɐqoʃƃ")uoıʇɔǝʃǝs‾ıʇʃnɯ‾ppɐ‾nuǝɯ = ɹǝʞɐǝɹq‾ɯıuɐ˙ɹǝʃpuɐɥ‾ın
(ǝsʃɐɟ '"ǝʃqısıʌ sǝıɯǝuǝ uo ǝƃɹɐɥɔ ǝʃqɐsıp" '"ʃɐqoʃƃ")xoqʞɔǝɥɔ‾ppɐ‾nuǝɯ = ǝƃɹɐɥɔ‾ǝʃqɐsıp˙ɹǝʃpuɐɥ‾ın
(81 '4 '"pǝǝds ʇp" '"ʃɐqoʃƃ")ɹǝpıʃs‾ppɐ‾nuǝɯ = ǝnʃɐʌ‾pǝǝds‾dɐʇǝʃqnop˙ɹǝʃpuɐɥ‾ın
(ǝsʃɐɟ '"pǝǝds ʇp ǝƃuɐɥɔ" '"ʃɐqoʃƃ")xoqʞɔǝɥɔ‾ppɐ‾nuǝɯ = pǝǝds‾dɐʇǝʃqnop˙ɹǝʃpuɐɥ‾ın
(001 '0 '"ǝɔuɐɥɔʇıɥ ɹıɐ" '"ʃɐqoʃƃ")ɹǝpıʃs‾ppɐ‾nuǝɯ = ǝɔuɐɥɔʇıɥ‾ɹıɐ˙ɹǝʃpuɐɥ‾ın
(ǝsʃɐɟ '"ǝɔuɐɥɔʇıɥ ɹıɐ ɯoʇsnɔ" '"ʃɐqoʃƃ")xoqʞɔǝɥɔ‾ppɐ‾nuǝɯ = ǝɔuɐɥɔʇıɥ‾ɹıɐ‾ɯoʇsnɔ˙ɹǝʃpuɐɥ‾ın
(ǝsʃɐɟ '"ǝɟıuʞ dɐʇǝʃqnop" '"ʃɐqoʃƃ")xoqʞɔǝɥɔ‾ppɐ‾nuǝɯ = ǝɟıuʞ‾dɐʇǝʃqnop˙ɹǝʃpuɐɥ‾ın
(ǝsʃɐɟ '"ǝʃqɐuǝ" '"ʃɐqoʃƃ")xoqʞɔǝɥɔ‾ppɐ‾nuǝɯ = ɥɔʇıʍsɹǝʇsɐɯ‾ʃɐqoʃƃ˙ɹǝʃpuɐɥ‾ın
({"sƃıɟuoɔ" '"ɔsıɯ" '"ƃɐʃ ǝʞɐɟ" '"sɯıɐ ıʇuɐ" '"sʃɐnsıʌ" '"ʃɐqoʃƃ"} '"uoıʇɔǝʃǝs qɐʇ" '"sʃʃɐq ɐƃƃıu ƃiq oʇ ǝɯoɔʃǝʍ")uoıʇɔǝʃǝs‾ppɐ‾nuǝɯ = uoıʇɔǝʃǝsqɐʇ˙ɹǝʃpuɐɥ‾ın


(ʍopɐɥsdoɹp˙sƃɐʃɟ‾ʇuoɟ‾ǝ '002 '21 '"ɐuɐpɹǝʌ")ʇuoɟ‾ǝʇɐǝɹɔ‾ɹǝpuǝɹ = 21ɐuɐpɹǝʌ˙ʇuoɟ
(ʍopɐɥsdoɹp˙sƃɐʃɟ‾ʇuoɟ‾ǝ '006 '03 '"pʃoq ıɹqıʃɐɔ")ʇuoɟ‾ǝʇɐǝɹɔ‾ɹǝpuǝɹ = qıɹqıʃɐɔ˙ʇuoɟ

ƃnqǝp‾sɔ‾ʌoɟ˙sɹɐʌɔ = ƃnqǝp‾sɔ‾ʌoɟ˙sɹɐʌɔ˙sǝuıɟǝp
sʞɔıʇssǝɔoɹdpɯɔɹsnxɐɯ‾ʌs˙sɹɐʌɔ = sʞɔıʇssǝɔoɹdpɯɔɹsnxɐɯ‾ʌs˙sɹɐʌɔ˙sǝuıɟǝp

{} = sɹɐʌɔ˙sǝuıɟǝp

{
"ɹıɐ"    
'"ƃuıʌoɯ"    
'"ʞʃɐʍʍoʃs"    
'"ƃuıɥɔnoɹɔ"    
'"ƃuıpuɐʇs"    
'"ǝsn uo"    
'"pǝɹɐɥs"    
} = sǝʇɐʇsɹǝʎɐʃd˙sǝuıɟǝp

{8 '7 '41 '31 '2 '5 '0} = xoqʇıɥ‾oʇ‾dnoɹƃʇıɥ˙sǝuıɟǝp

{
"ǝpɐuǝɹƃʌoʇoʃoɯɔ"    
'"ǝpɐuǝɹƃʎoɔǝpɔ"    
'"ƃuɐqɥsɐʃɟɔ"    
'"ǝpɐuǝɹƃǝʞoɯsɔ"    
'"ǝpɐuǝɹƃʎɹɐıpuǝɔuıɔ"    
'"ǝpɐuǝɹƃǝɥɔ"    
} = sǝpɐu˙sǝuıɟǝp

{
"ɹɐǝƃ" = [01]    
'"ƃǝʃ ʇɥƃıɹ" = [7]    
'"ƃǝʃ ʇɟǝʃ" = [6]    
'"ɯɹɐ ʇɥƃıɹ" = [5]    
'"ɯɹɐ ʇɟǝʃ" = [4]    
'"ɥɔɐɯoʇs" = [3]    
'"ʇsǝɥɔ" = [2]    
'"pɐǝɥ" = [1]    
'"ɔıɹǝuǝƃ" = [0]    
} = sdnoɹƃʇıɥ˙sǝuıɟǝp

{
'"ɹoɹɹǝ ˙pǝɹd" = [4]    
'"uoısnʃɔɔo" = [3]    
'"pɐǝɹds" = [2]    
'"ɹǝʌʃosǝɹ" = [1]    
'"ʇıɥ" = [0]    
} = suosɐǝɹ‾ssıɯ˙sǝuıɟǝp

{
ǝnɹʇ = [762]    
 'ǝnɹʇ = [332]    
 'ǝnɹʇ = [242]    
 'ǝnɹʇ = [162]    
} = suodɐǝʍ‾ǝdoɔsou˙sǝuıɟǝp

puǝ
ǝnɹʇ = ǝɹıɟʇoɥsuo˙sǝuıɟǝp    
(ʇoɥs) uoıʇɔunɟ = ʇɹɐʇs‾ǝʇɐpdnǝɹıɟuo˙sǝuıɟǝp

ǝsʃɐɟ = ǝɹıɟʇoɥsuo˙sǝuıɟǝp

("ʇunoɯɐ ʇɥƃıɹ" '"puɐʇs" '"ɔuʎsǝp" '"uıɐɯ" '"ɯıɐıʇuɐ")puıɟ‾nuǝɯ = ʇɥƃıɹ‾ʇıɯıʃ‾ǝʞɐɟ˙sɟǝɹ‾ʃɐıpɹoɯıɹd
("ʇunoɯɐ ʇɟǝʃ" '"puɐʇs" '"ɔuʎsǝp" '"uıɐɯ" '"ɯıɐıʇuɐ")puıɟ‾nuǝɯ = ʇɟǝʃ‾ʇıɯıʃ‾ǝʞɐɟ˙sɟǝɹ‾ʃɐıpɹoɯıɹd
("ǝpıs" '"puɐʇs" '"ɔuʎsǝp" '"uıɐɯ" '"ɯıɐıʇuɐ")puıɟ‾nuǝɯ = ǝpıs˙sɟǝɹ‾ʃɐıpɹoɯıɹd
("ppɐ ɹǝʇʇıɾ" '"sǝʃƃuɐ" '"uıɐɯ" '"ɯıɐıʇuɐ")puıɟ‾nuǝɯ = ǝǝɹƃǝp‾ɹǝıɟıpoɯ˙sɟǝɹ‾ʃɐıpɹoɯıɹd
("ǝpoɯ ɹǝʇʇıɾ" '"sǝʃƃuɐ" '"uıɐɯ" '"ɯıɐıʇuɐ")puıɟ‾nuǝɯ = ɹǝıɟıpoɯ‾ʍɐʎ˙sɟǝɹ‾ʃɐıpɹoɯıɹd
("ppɐ ʍɐʎ" '"sǝʃƃuɐ" '"uıɐɯ" '"ɯıɐıʇuɐ")puıɟ‾nuǝɯ = ppɐ‾ʍɐʎ˙sɟǝɹ‾ʃɐıpɹoɯıɹd
{("ǝnʃɐʌ uɐǝʃ ʎpoq" '"sǝʃƃuɐ" '"uıɐɯ" '"ɯıɐıʇuɐ")puıɟ‾nuǝɯ '("uɐǝʃ ʎpoq" '"sǝʃƃuɐ" '"uıɐɯ" '"ɯıɐıʇuɐ")puıɟ‾nuǝɯ} = ɐɐ‾ʃʃoɹ˙sɟǝɹ‾ʃɐıpɹoɯıɹd
("ɔuʎsǝp ʇɹǝʌuı" '"ʃɐnuɐɯ" '"uıɐɯ" '"ɯıɐıʇuɐ")puıɟ‾nuǝɯ = ɹǝʇɹǝʌuı˙sɟǝɹ‾ʃɐıpɹoɯıɹd
("ǝʃqɐuǝ" '"uoıʇɔǝɹıp oʇnɐ" '"uıɐɯ" '"ɯıɐıʇuɐ")puıɟ‾nuǝɯ = ƃuıpuɐʇsǝǝɹɟ˙sɟǝɹ‾ʃɐıpɹoɯıɹd
("ʇɥƃıɹ" '"ʃɐnuɐɯ" '"uıɐɯ" '"ɯıɐıʇuɐ")puıɟ‾nuǝɯ = ʇɥƃıɹʃɐnuɐɯ˙sɟǝɹ‾ʃɐıpɹoɯıɹd
("ʞɔɐq" '"ʃɐnuɐɯ" '"uıɐɯ" '"ɯıɐıʇuɐ")puıɟ‾nuǝɯ = ʞɔɐqʃɐnuɐɯ˙sɟǝɹ‾ʃɐıpɹoɯıɹd
("ʇɟǝʃ" '"ʃɐnuɐɯ" '"uıɐɯ" '"ɯıɐıʇuɐ")puıɟ‾nuǝɯ = ʇɟǝʃʃɐnuɐɯ˙sɟǝɹ‾ʃɐıpɹoɯıɹd
("uoıʇɐsuǝdɯoɔ ƃɐʃ ʞɐǝɹq" '"ƃɐʃǝʞɐɟ" '"uıɐɯ" '"ɯıɐıʇuɐ")puıɟ‾nuǝɯ = ɔʃʞɐǝɹq˙sɟǝɹ‾ʃɐıpɹoɯıɹd
("ʇunoɯɐ" '"ƃɐʃǝʞɐɟ" '"uıɐɯ" '"ɯıɐıʇuɐ")puıɟ‾nuǝɯ = ʇıɯıʃƃɐʃǝʞɐɟ˙sɟǝɹ‾ʃɐıpɹoɯıɹd
("ǝʃqɐuǝ" '"ʃɐɹǝuǝƃ" '"uıɐɯ" '"ɯıɐıʇuɐ")puıɟ‾nuǝɯ = ɐɐǝʃqɐuǝ˙sɟǝɹ‾ʃɐıpɹoɯıɹd
("ǝʃqɐuǝ" '"dɐʇǝʃqnop" '"sʇıoʃdxǝ" '"ʃɐɹǝuǝƃ" '"ʇoqɯıɐ")puıɟ‾nuǝɯ = dɐʇ‾ǝʃqnop˙sɟǝɹ‾ʃɐıpɹoɯıɹd
("ʞʃɐʍ ʍoʃs" '"ʇuǝɯǝʌoɯ" '"uıɐɯ" '"ɔsıɯ")puıɟ‾nuǝɯ = ʞʃɐʍ‾ʍoʃs˙sɟǝɹ‾ʃɐıpɹoɯıɹd

(01 '1)ʇɟıɥsʃ‾ʇıq =        	ɹǝʇɐʍuı‾ʃɟ   ʃɐɔoʃ
(9 '1)ʇɟıɥsʃ‾ʇıq =       ʇuǝıʃɔǝʞɐɟ‾ʃɟ   ʃɐɔoʃ
(8 '1)ʇɟıɥsʃ‾ʇıq =        	ʇuǝıʃɔ‾ʃɟ   ʃɐɔoʃ
(7 '1)ʇɟıɥsʃ‾ʇıq =       sʃoɹʇuoɔʇɐ‾ʃɟ   ʃɐɔoʃ
(6 '1)ʇɟıɥsʃ‾ʇıq =        	uǝzoɹɟ‾ʃɟ   ʃɐɔoʃ
(5 '1)ʇɟıɥsʃ‾ʇıq =        	uıɐɹuı‾ʃɟ   ʃɐɔoʃ
(4 '1)ʇɟıɥsʃ‾ʇıq =        	uıɐɹʇuo‾ʃɟ   ʃɐɔoʃ
(3 '1)ʇɟıɥsʃ‾ʇıq =        dɯnɾɹǝʇɐʍ‾ʃɟ   ʃɐɔoʃ
(1 '1)ʇɟıɥsʃ‾ʇıq =        	ƃuıʞɔnp‾ʃɟ   ʃɐɔoʃ
(0 '1)ʇɟıɥsʃ‾ʇıq =        	punoɹƃuo‾ʃɟ   ʃɐɔoʃ

(22 '1)ʇɟıɥsʃ‾ʇıq =			ɥsnɹʃʃnq‾uı   ʃɐɔoʃ
(12 '1)ʇɟıɥsʃ‾ʇıq =			2uodɐǝʍ‾uı   ʃɐɔoʃ
(02 '1)ʇɟıɥsʃ‾ʇıq =			1uodɐǝʍ‾uı   ʃɐɔoʃ
(ǝɹns ʇou) uodɐǝʍ ɯooz -- (91 '1)ʇɟıɥsʃ‾ʇıq =				ɯooz‾uı   ʃɐɔoʃ
ʇɟıɥs -- (81 '1)ʇɟıɥsʃ‾ʇıq =				ʞʃɐʍ‾uı   ʃɐɔoʃ
(71 '1)ʇɟıɥsʃ‾ʇıq =			pǝǝds‾uı   ʃɐɔoʃ
(61 '1)ʇɟıɥsʃ‾ʇıq =			ǝɹoɔs‾uı   ʃɐɔoʃ
(51 '1)ʇɟıɥsʃ‾ʇıq =				2ʇʃɐ‾uı   ʃɐɔoʃ
(41 '1)ʇɟıɥsʃ‾ʇıq =				1ʇʃɐ‾uı   ʃɐɔoʃ
uodɐǝʍ pɐoʃǝɹ -- (31 '1)ʇɟıɥsʃ‾ʇıq =			pɐoʃǝɹ‾uı   ʃɐɔoʃ
(21 '1)ʇɟıɥsʃ‾ʇıq =				unɹ‾uı   ʃɐɔoʃ
(ǝɹns ʇou) (ǝpoɯ ǝɹıɟ ǝƃuɐɥɔ sɐɯɐɟ 'ǝpoɯ ǝɹıɟ ǝƃuɐɥɔ ʞɔoʃƃ 'ɹǝʌʃoʌǝɹ) ǝɹıɟ ʎɹɐpuoɔǝs -- (11 '1)ʇɟıɥsʃ‾ʇıq =			2ʞɔɐʇʇɐ‾uı   ʃɐɔoʃ
(ǝɹns ʇou) ¿sɐıʃɐ -- (01 '1)ʇɟıɥsʃ‾ʇıq =		ʇɥƃıɹǝʌoɯ‾uı   ʃɐɔoʃ
(ǝɹns ʇou) ¿sɐıʃɐ -- (9 '1)ʇɟıɥsʃ‾ʇıq =			ʇɟǝʃǝʌoɯ‾uı   ʃɐɔoʃ
ʇɥƃıɹ ʞʃɐʍ -- (8 '1)ʇɟıɥsʃ‾ʇıq =			ʇɥƃıɹ‾uı   ʃɐɔoʃ
ʇɟǝʃ ʞʃɐʍ -- (7 '1)ʇɟıɥsʃ‾ʇıq =				ʇɟǝʃ‾uı   ʃɐɔoʃ
¿ ? -- (6 '1)ʇɟıɥsʃ‾ʇıq =			ʃǝɔuɐɔ‾uı   ʃɐɔoʃ
(˙˙˙ɔʇǝ 'qɯoq ǝsnɟǝp) ǝsn -- (5 '1)ʇɟıɥsʃ‾ʇıq =				ǝsn‾uı   ʃɐɔoʃ
spɹɐʍʞɔɐq ʞʃɐʍ -- (4 '1)ʇɟıɥsʃ‾ʇıq =				ʞɔɐq‾uı   ʃɐɔoʃ
pɹɐʍɹoɟ ʞʃɐʍ -- (3 '1)ʇɟıɥsʃ‾ʇıq =			pɹɐʍɹoɟ‾uı   ʃɐɔoʃ
ɥɔnoɹɔ -- (2 '1)ʇɟıɥsʃ‾ʇıq =				ʞɔnp‾uı   ʃɐɔoʃ
dɯnɾ -- (1 '1)ʇɟıɥsʃ‾ʇıq =				dɯnɾ‾uı   ʃɐɔoʃ
uodɐǝʍ ǝɹıɟ -- (0 '1)ʇɟıɥsʃ‾ʇıq =			ʞɔɐʇʇɐ‾uı   ʃɐɔoʃ
。002为制限块区的来将免避以 中表个一到动移量变些这将 :opoʇ --

puǝ
(5˙0 + ǝnʃɐʌ)ɹooʃɟ˙ɥʇɐɯ uɹnʇǝɹ    
0 ɹo (ǝnʃɐʌ)ɹǝqɯnuoʇ = ǝnʃɐʌ    
(ǝnʃɐʌ)uoıʇɔunɟ = punoɹ‾ɥʇɐɯ ʃɐɔoʃ

puǝ
ɔuʎsǝp‾d uɹnʇǝɹ    
001 * (06 \ ʃɐʌ) = ɔuʎsǝp‾d ʃɐɔoʃ    
(ʃɐʌ) uoıʇɔunɟ = ɔuʎsǝp‾ɥʇɐɯ ʃɐɔoʃ

puǝ
(˙˙˙)ʇuıɹd uɹnʇǝɹ    
(˙˙˙)uoıʇɔunɟ = ƃnqǝp ʃɐɔoʃ

()ǝzıs‾uǝǝɹɔs‾ʇǝƃ‾ɹǝpuǝɹ = ǝzıs‾uǝǝɹɔs ʃɐɔoʃ

{
'"^^ ǝɔuǝıɹǝdxǝ ʇsǝq ǝɥʇ ɹoɟ ʍou ʞooɥɹǝƃƃ*u ʇǝƃ ¿sǝıɯǝuǝ ɹnoʎ ǝʇɐuıɯop oʇ ʇuɐʍ"    
'"^^ 怜可般一人器机路走的力无个像你'子婊的妈你去"    
'"^^ ˙ʃɐıpɹoɯıɹd ɹoɟ ɯǝʇı ʇdıɹɔs ʃʃɐ &lt; ɐnʃ ʞooɥɹǝƃƃ*u"    
'"^^ 物动个一是你，猫的妈他你，友朋女有没你"    
'"^^ ɥɔʇıq ƃuıʞɔnɟ ɹnoʎ"    
'"^^ 头舌的你着动抽在q骚霉发的妈你像好你'狗臭小'你谢感"    
'"7488#ʞoʎɯıʇɐʎɐɥ :ʇdıɹɔs&ƃıɟuoɔ ʇsǝq ǝɥʇ ʇǝƃ"    
'"^^ ¿pɐp ¿ɯoɯ"    
'"^^ sʎs71ɟq :ɹoɥʇnɐ doʇ ʎq ǝpoɔ"    
'"^^ 手对位一每的您配支'棘斩荆披您带会将本脚ǝsıpɐɹɐd"    
'"^^ ¿¿¿bı ɹn s,ǝɹǝɥʍ ʃ"    
'"^^ ɐnʃʞooɥɹǝƃƃiu ʎq pǝʇɐǝɟǝp pǝʃʃıʞ uǝǝq ǝʌ,noʎ 'oʃʃǝɥ"    
'"^^ 戏游得赢ʃɐıpɹoɯıɹd买购'持支本脚的力强最球全得获"    
'"^^ ʇoq-ʞʃɐʍ ɐ ǝʞıʃ ʇsnɾ noʎ ʃoʃ"    
} = sǝsɐɹɥd˙ʎɐs‾ʃʃıʞ

{} = uʍopʇnɥs ʃɐɔoʃ
{} = ƃoʃʇıɥ ʃɐɔoʃ
{} = ʎɐs‾ʃʃıʞ ʃɐɔoʃ
{} = sƃıɟuoɔ ʃɐɔoʃ
{} = ɹǝʞɹɐɯ‾ǝƃɐɯɐp ʃɐɔoʃ
{} = sʍoɹɹɐ‾ʃɐnuɐɯ ʃɐɔoʃ
{} = ɹoʇɐɔıpuı‾ɹıɐɥssoɹɔ ʃɐɔoʃ
{} = ɹoʇɐɔıpuı‾ƃɐʃǝʞɐɟ ʃɐɔoʃ
{} = ǝdoɔs‾ɯoʇsnɔ ʃɐɔoʃ
{} = sʇɔǝɟɟǝ‾nuǝɯ ʃɐɔoʃ
{} = ɹoʃoɔ‾ǝʃosuoɔ ʃɐɔoʃ
{} = sƃoʃʇıɥ ʃɐɔoʃ
{} = ǝɔɹoɟǝʇnɹq‾ıʇuɐ ʃɐɔoʃ
{} = ɹǝʞɐǝɹq‾uoıʇɐɯıuɐ ʃɐɔoʃ
{} = ɹıɐ‾ʇıoʃdxǝ ʃɐɔoʃ
{} = ʍɐʎ‾ǝƃpǝ ʃɐɔoʃ
{} = sɟǝɹ‾ʃɐıpɹoɯıɹd ʃɐɔoʃ
{} = ƃɐʃǝʞɐɟ ʃɐɔoʃ
{} = sɯıɐıʇuɐ‾ʃɐuoıʇıpuoɔ ʃɐɔoʃ
{} = sɯıɐıʇuɐ‾ʇʃnɐɟǝp ʃɐɔoʃ
{} = ɯıɐıʇuɐ‾ʃʃoɹ ʃɐɔoʃ
{} = sɹɐʌ‾ɯıɐıʇuɐ ʃɐɔoʃ
{} = ɯǝʇsʎs‾puıq ʃɐɔoʃ
{} = ɹǝʃʃoɹʇuoɔ‾ʃɐnsıʌ ʃɐɔoʃ
{} = ǝdoɔs‾uı‾ʃǝpoɯʍǝıʌ ʃɐɔoʃ
{} = sǝuıɟǝp ʃɐɔoʃ
{} = ɹǝʃʃoɹʇuoɔ‾dɐʇǝʃqnop ʃɐɔoʃ
{} = ɹǝʃpuɐɥ‾ıɟɟ ʃɐɔoʃ
{} = ʇoqɯıɐ‾ʇuɐɯɹop ʃɐɔoʃ
{} = sɹǝdʃǝɥ‾ʎʇıʇuǝ ʃɐɔoʃ
{} = ʇuoɟ ʃɐɔoʃ
{} = sɹǝʃpuɐɥ ʃɐɔoʃ
{} = ǝɔuɐɥɔʇıɥ‾ʃɐuoıʇıpuoɔ ʃɐɔoʃ
{} = ɹǝʃpuɐɥ‾ın ʃɐɔoʃ

ǝƃɹɐɥɔ‾ʇǝƃ˙sʇıoʃdxǝ 'ǝpıɹɹǝʌo‾ʃɐnuɐɯ‾ʇǝƃ˙ɯıɐıʇuɐ 'ǝʃƃuɐ‾ǝʞɐɟ‾ʇǝƃ˙ɯıɐıʇuɐ 'ǝʃƃuɐ‾ʃɐǝɹ‾ʇǝƃ˙ɯıɐıʇuɐ 'ǝƃuɐɹ‾ɔuʎsǝp‾xɐɯ‾ʇǝƃ˙ɯıɐıʇuɐ 'ǝzıs‾ʇxǝʇ‾ʇǝƃ˙ɹǝpuǝɹ 'ǝpɐɟ‾ʇɔǝɹ˙ɹǝpuǝɹ 'ǝzıs‾uǝǝɹɔs‾ʇǝƃ˙ɹǝpuǝɹ 'ʇxǝʇ˙ɹǝpuǝɹ 'ʇuoɟ‾ǝʇɐǝɹɔ˙ɹǝpuǝɹ 'spuɐɯɯoɔ‾pǝʞoɥɔ‾ʇǝƃ˙ǝuıƃuǝ 'puıɟ˙nuǝɯ 'uǝdo‾sı˙nuǝɯ 'ʎʇıʃıqısıʌ‾dnoɹƃ‾ʇǝs˙nuǝɯ 'uoıʇɔǝʃǝs‾ıʇʃnɯ‾ppɐ˙nuǝɯ 'uoıʇɔǝʃǝs‾ppɐ˙nuǝɯ 'ɹǝpıʃs‾ppɐ˙nuǝɯ 'xoqʞɔǝɥɔ‾ppɐ˙nuǝɯ = ǝƃɹɐɥɔ‾ʇǝƃ‾sʇıoʃdxǝ 'ǝpıɹɹǝʌo‾ʃɐnuɐɯ‾ʇǝƃ‾ɯıɐıʇuɐ 'ǝʃƃuɐ‾ǝʞɐɟ‾ʇǝƃ‾ɯıɐıʇuɐ 'ǝʃƃuɐ‾ʃɐǝɹ‾ʇǝƃ‾ɯıɐıʇuɐ 'ǝƃuɐɹ‾ɔuʎsǝp‾xɐɯ‾ʇǝƃ‾ɯıɐıʇuɐ 'ǝzıs‾ʇxǝʇ‾ʇǝƃ‾ɹǝpuǝɹ 'ǝpɐɟ‾ʇɔǝɹ‾ɹǝpuǝɹ 'ǝzıs‾uǝǝɹɔs‾ʇǝƃ‾ɹǝpuǝɹ 'ʇxǝʇ‾ɹǝpuǝɹ 'ʇuoɟ‾ǝʇɐǝɹɔ‾ɹǝpuǝɹ 'spuɐɯɯoɔpǝʞoɥɔ‾sʃɐqoʃƃ 'puıɟ‾nuǝɯ 'uǝdo‾sı‾nuǝɯ 'ʎʇıʃıqısıʌ‾dnoɹƃ‾ʇǝs‾nuǝɯ 'uoıʇɔǝʃǝs‾ıʇʃnɯ‾ppɐ‾nuǝɯ 'uoıʇɔǝʃǝs‾ppɐ‾nuǝɯ 'ɹǝpıʃs‾ppɐ‾nuǝɯ 'xoqʞɔǝɥɔ‾ppɐ‾nuǝɯ ʃɐɔoʃ
ʇɟıɥsʃ˙ʇıq 'ɹoq˙ʇıq 'ʇouq˙ʇıq 'puɐq˙ʇıq = ʇɟıɥsʃ‾ʇıq 'ɹoq‾ʇıq 'ʇouq‾ʇıq 'puɐq‾ʇıq ʃɐɔoʃ
"ıɟɟ" ǝɹınbǝɹ = ıɟɟ ʃɐɔoʃ
失丢时成生新重在将都改更何任的行下以对 量变部局的数函ıdɐ --
